Model: "dryrun-01"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input_1 (InputLayer)                          [(None, 224, 224, 1)]          0                                                              
____________________________________________________________________________________________________________________________________________
dropout (Dropout)                             (None, 224, 224, 1)            0               input_1[0][0]                                  
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv1 (SeparableConv2D)       (None, 224, 224, 8)            25              dropout[0][0]                                  
____________________________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)      (None, 224, 224, 8)            32              encoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation (Activation)                       (None, 224, 224, 8)            0               batch_normalization[0][0]                      
____________________________________________________________________________________________________________________________________________
dropout_1 (Dropout)                           (None, 224, 224, 8)            0               activation[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv2 (SeparableConv2D)       (None, 224, 224, 16)           216             dropout_1[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)    (None, 224, 224, 16)           64              encoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv-skip (SeparableConv2D)   (None, 224, 224, 16)           41              dropout[0][0]                                  
____________________________________________________________________________________________________________________________________________
add (Add)                                     (None, 224, 224, 16)           0               batch_normalization_1[0][0]                    
                                                                                             encoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_1 (Activation)                     (None, 224, 224, 16)           0               add[0][0]                                      
____________________________________________________________________________________________________________________________________________
encoder-block-0-DOWN (Conv2D)                 (None, 112, 112, 16)           2320            activation_1[0][0]                             
____________________________________________________________________________________________________________________________________________
dropout_2 (Dropout)                           (None, 112, 112, 16)           0               encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv1 (SeparableConv2D)       (None, 112, 112, 16)           416             dropout_2[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)    (None, 112, 112, 16)           64              encoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_2 (Activation)                     (None, 112, 112, 16)           0               batch_normalization_2[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_3 (Dropout)                           (None, 112, 112, 16)           0               activation_2[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv2 (SeparableConv2D)       (None, 112, 112, 32)           688             dropout_3[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)    (None, 112, 112, 32)           128             encoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv-skip (SeparableConv2D)   (None, 112, 112, 32)           688             dropout_2[0][0]                                
____________________________________________________________________________________________________________________________________________
add_1 (Add)                                   (None, 112, 112, 32)           0               batch_normalization_3[0][0]                    
                                                                                             encoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_3 (Activation)                     (None, 112, 112, 32)           0               add_1[0][0]                                    
____________________________________________________________________________________________________________________________________________
encoder-block-1-DOWN (Conv2D)                 (None, 56, 56, 32)             9248            activation_3[0][0]                             
____________________________________________________________________________________________________________________________________________
dropout_4 (Dropout)                           (None, 56, 56, 32)             0               encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv1 (SeparableConv2D)       (None, 56, 56, 32)             1344            dropout_4[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)    (None, 56, 56, 32)             128             encoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_4 (Activation)                     (None, 56, 56, 32)             0               batch_normalization_4[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_5 (Dropout)                           (None, 56, 56, 32)             0               activation_4[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv2 (SeparableConv2D)       (None, 56, 56, 64)             2400            dropout_5[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)    (None, 56, 56, 64)             256             encoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv-skip (SeparableConv2D)   (None, 56, 56, 64)             2400            dropout_4[0][0]                                
____________________________________________________________________________________________________________________________________________
add_2 (Add)                                   (None, 56, 56, 64)             0               batch_normalization_5[0][0]                    
                                                                                             encoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_5 (Activation)                     (None, 56, 56, 64)             0               add_2[0][0]                                    
____________________________________________________________________________________________________________________________________________
encoder-block-2-DOWN (Conv2D)                 (None, 28, 28, 64)             36928           activation_5[0][0]                             
____________________________________________________________________________________________________________________________________________
dropout_6 (Dropout)                           (None, 28, 28, 64)             0               encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv1 (SeparableConv2D)       (None, 28, 28, 64)             4736            dropout_6[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)    (None, 28, 28, 64)             256             encoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_6 (Activation)                     (None, 28, 28, 64)             0               batch_normalization_6[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_7 (Dropout)                           (None, 28, 28, 64)             0               activation_6[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv2 (SeparableConv2D)       (None, 28, 28, 128)            8896            dropout_7[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)    (None, 28, 28, 128)            512             encoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv-skip (SeparableConv2D)   (None, 28, 28, 128)            8896            dropout_6[0][0]                                
____________________________________________________________________________________________________________________________________________
add_3 (Add)                                   (None, 28, 28, 128)            0               batch_normalization_7[0][0]                    
                                                                                             encoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_7 (Activation)                     (None, 28, 28, 128)            0               add_3[0][0]                                    
____________________________________________________________________________________________________________________________________________
encoder-block-3-DOWN (Conv2D)                 (None, 14, 14, 128)            147584          activation_7[0][0]                             
____________________________________________________________________________________________________________________________________________
dropout_8 (Dropout)                           (None, 14, 14, 128)            0               encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv1 (SeparableConv2D)       (None, 14, 14, 128)            17664           dropout_8[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)    (None, 14, 14, 128)            512             encoder-block-4-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_8 (Activation)                     (None, 14, 14, 128)            0               batch_normalization_8[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_9 (Dropout)                           (None, 14, 14, 128)            0               activation_8[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv2 (SeparableConv2D)       (None, 14, 14, 256)            34176           dropout_9[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)    (None, 14, 14, 256)            1024            encoder-block-4-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv-skip (SeparableConv2D)   (None, 14, 14, 256)            34176           dropout_8[0][0]                                
____________________________________________________________________________________________________________________________________________
add_4 (Add)                                   (None, 14, 14, 256)            0               batch_normalization_9[0][0]                    
                                                                                             encoder-block-4-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_9 (Activation)                     (None, 14, 14, 256)            0               add_4[0][0]                                    
____________________________________________________________________________________________________________________________________________
decoder-block-3-UP (Conv2DTranspose)          (None, 28, 28, 256)            590080          activation_9[0][0]                             
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 28, 28, 384)            0               activation_7[0][0]                             
                                                                                             decoder-block-3-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
dropout_10 (Dropout)                          (None, 28, 28, 384)            0               concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv1 (SeparableConv2D)       (None, 28, 28, 128)            52736           dropout_10[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalization)   (None, 28, 28, 128)            512             decoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_10 (Activation)                    (None, 28, 28, 128)            0               batch_normalization_10[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_11 (Dropout)                          (None, 28, 28, 128)            0               activation_10[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv2 (SeparableConv2D)       (None, 28, 28, 128)            17664           dropout_11[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_11 (BatchNormalization)   (None, 28, 28, 128)            512             decoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv-skip (SeparableConv2D)   (None, 28, 28, 128)            52736           dropout_10[0][0]                               
____________________________________________________________________________________________________________________________________________
add_5 (Add)                                   (None, 28, 28, 128)            0               batch_normalization_11[0][0]                   
                                                                                             decoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_11 (Activation)                    (None, 28, 28, 128)            0               add_5[0][0]                                    
____________________________________________________________________________________________________________________________________________
decoder-block-2-UP (Conv2DTranspose)          (None, 56, 56, 128)            147584          activation_11[0][0]                            
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 56, 56, 192)            0               activation_5[0][0]                             
                                                                                             decoder-block-2-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
dropout_12 (Dropout)                          (None, 56, 56, 192)            0               concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv1 (SeparableConv2D)       (None, 56, 56, 64)             14080           dropout_12[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_12 (BatchNormalization)   (None, 56, 56, 64)             256             decoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_12 (Activation)                    (None, 56, 56, 64)             0               batch_normalization_12[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_13 (Dropout)                          (None, 56, 56, 64)             0               activation_12[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv2 (SeparableConv2D)       (None, 56, 56, 64)             4736            dropout_13[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_13 (BatchNormalization)   (None, 56, 56, 64)             256             decoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv-skip (SeparableConv2D)   (None, 56, 56, 64)             14080           dropout_12[0][0]                               
____________________________________________________________________________________________________________________________________________
add_6 (Add)                                   (None, 56, 56, 64)             0               batch_normalization_13[0][0]                   
                                                                                             decoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_13 (Activation)                    (None, 56, 56, 64)             0               add_6[0][0]                                    
____________________________________________________________________________________________________________________________________________
decoder-block-1-UP (Conv2DTranspose)          (None, 112, 112, 64)           36928           activation_13[0][0]                            
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 112, 112, 96)           0               activation_3[0][0]                             
                                                                                             decoder-block-1-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
dropout_14 (Dropout)                          (None, 112, 112, 96)           0               concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv1 (SeparableConv2D)       (None, 112, 112, 32)           3968            dropout_14[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_14 (BatchNormalization)   (None, 112, 112, 32)           128             decoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_14 (Activation)                    (None, 112, 112, 32)           0               batch_normalization_14[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_15 (Dropout)                          (None, 112, 112, 32)           0               activation_14[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv2 (SeparableConv2D)       (None, 112, 112, 32)           1344            dropout_15[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_15 (BatchNormalization)   (None, 112, 112, 32)           128             decoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv-skip (SeparableConv2D)   (None, 112, 112, 32)           3968            dropout_14[0][0]                               
____________________________________________________________________________________________________________________________________________
add_7 (Add)                                   (None, 112, 112, 32)           0               batch_normalization_15[0][0]                   
                                                                                             decoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_15 (Activation)                    (None, 112, 112, 32)           0               add_7[0][0]                                    
____________________________________________________________________________________________________________________________________________
decoder-block-0-UP (Conv2DTranspose)          (None, 224, 224, 32)           9248            activation_15[0][0]                            
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 224, 224, 48)           0               activation_1[0][0]                             
                                                                                             decoder-block-0-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
dropout_16 (Dropout)                          (None, 224, 224, 48)           0               concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv1 (SeparableConv2D)       (None, 224, 224, 16)           1216            dropout_16[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_16 (BatchNormalization)   (None, 224, 224, 16)           64              decoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_16 (Activation)                    (None, 224, 224, 16)           0               batch_normalization_16[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_17 (Dropout)                          (None, 224, 224, 16)           0               activation_16[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv2 (SeparableConv2D)       (None, 224, 224, 16)           416             dropout_17[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_17 (BatchNormalization)   (None, 224, 224, 16)           64              decoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv-skip (SeparableConv2D)   (None, 224, 224, 16)           1216            dropout_16[0][0]                               
____________________________________________________________________________________________________________________________________________
add_8 (Add)                                   (None, 224, 224, 16)           0               batch_normalization_17[0][0]                   
                                                                                             decoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_17 (Activation)                    (None, 224, 224, 16)           0               add_8[0][0]                                    
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 224, 224, 3)            51              activation_17[0][0]                            
============================================================================================================================================
Total params: 1,269,789
Trainable params: 1,267,341
Non-trainable params: 2,448
____________________________________________________________________________________________________________________________________________
