Model: "unet2halfd-sep.crop112-f16.fold000.1607-789-290"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input (InputLayer)                            [(None, 112, 112, 5)]          0                                                              
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1 (SeparableConv2D)           (None, 112, 112, 16)           141             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-bn (BatchNormalization)     (None, 112, 112, 16)           64              enc-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-relu (Activation)           (None, 112, 112, 16)           0               enc-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2 (SeparableConv2D)           (None, 112, 112, 32)           688             enc-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip (SeparableConv2D)       (None, 112, 112, 32)           237             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-bn (BatchNormalization)     (None, 112, 112, 32)           128             enc-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip-bn (BatchNormalization) (None, 112, 112, 32)           128             enc-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-0-residual (Add)                    (None, 112, 112, 32)           0               enc-block-0-conv2-bn[0][0]                     
                                                                                             enc-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-relu (Activation)           (None, 112, 112, 32)           0               enc-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN (Conv2D)                     (None, 56, 56, 32)             9248            enc-block-0-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-bn (BatchNormalization)      (None, 56, 56, 32)             128             enc-block-0-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-relu (Activation)            (None, 56, 56, 32)             0               enc-block-0-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1 (SeparableConv2D)           (None, 56, 56, 32)             1344            enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-bn (BatchNormalization)     (None, 56, 56, 32)             128             enc-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-relu (Activation)           (None, 56, 56, 32)             0               enc-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2 (SeparableConv2D)           (None, 56, 56, 64)             2400            enc-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip (SeparableConv2D)       (None, 56, 56, 64)             2400            enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-bn (BatchNormalization)     (None, 56, 56, 64)             256             enc-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip-bn (BatchNormalization) (None, 56, 56, 64)             256             enc-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-residual (Add)                    (None, 56, 56, 64)             0               enc-block-1-conv2-bn[0][0]                     
                                                                                             enc-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-relu (Activation)           (None, 56, 56, 64)             0               enc-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN (Conv2D)                     (None, 28, 28, 64)             36928           enc-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-bn (BatchNormalization)      (None, 28, 28, 64)             256             enc-block-1-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-relu (Activation)            (None, 28, 28, 64)             0               enc-block-1-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1 (SeparableConv2D)           (None, 28, 28, 64)             4736            enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-bn (BatchNormalization)     (None, 28, 28, 64)             256             enc-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-relu (Activation)           (None, 28, 28, 64)             0               enc-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2 (SeparableConv2D)           (None, 28, 28, 128)            8896            enc-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip (SeparableConv2D)       (None, 28, 28, 128)            8896            enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-bn (BatchNormalization)     (None, 28, 28, 128)            512             enc-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip-bn (BatchNormalization) (None, 28, 28, 128)            512             enc-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-residual (Add)                    (None, 28, 28, 128)            0               enc-block-2-conv2-bn[0][0]                     
                                                                                             enc-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-relu (Activation)           (None, 28, 28, 128)            0               enc-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN (Conv2D)                     (None, 14, 14, 128)            147584          enc-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-bn (BatchNormalization)      (None, 14, 14, 128)            512             enc-block-2-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-relu (Activation)            (None, 14, 14, 128)            0               enc-block-2-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1 (SeparableConv2D)           (None, 14, 14, 128)            17664           enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-bn (BatchNormalization)     (None, 14, 14, 128)            512             enc-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-relu (Activation)           (None, 14, 14, 128)            0               enc-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2 (SeparableConv2D)           (None, 14, 14, 256)            34176           enc-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip (SeparableConv2D)       (None, 14, 14, 256)            34176           enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-bn (BatchNormalization)     (None, 14, 14, 256)            1024            enc-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip-bn (BatchNormalization) (None, 14, 14, 256)            1024            enc-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-residual (Add)                    (None, 14, 14, 256)            0               enc-block-3-conv2-bn[0][0]                     
                                                                                             enc-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-relu (Activation)           (None, 14, 14, 256)            0               enc-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN (Conv2D)                     (None, 7, 7, 256)              590080          enc-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-bn (BatchNormalization)      (None, 7, 7, 256)              1024            enc-block-3-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-relu (Activation)            (None, 7, 7, 256)              0               enc-block-3-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1 (SeparableConv2D)           (None, 7, 7, 256)              68096           enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-bn (BatchNormalization)     (None, 7, 7, 256)              1024            enc-block-4-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-relu (Activation)           (None, 7, 7, 256)              0               enc-block-4-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2 (SeparableConv2D)           (None, 7, 7, 512)              133888          enc-block-4-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip (SeparableConv2D)       (None, 7, 7, 512)              133888          enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-bn (BatchNormalization)     (None, 7, 7, 512)              2048            enc-block-4-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip-bn (BatchNormalization) (None, 7, 7, 512)              2048            enc-block-4-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-residual (Add)                    (None, 7, 7, 512)              0               enc-block-4-conv2-bn[0][0]                     
                                                                                             enc-block-4-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-relu (Activation)           (None, 7, 7, 512)              0               enc-block-4-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-UP (Conv2DTranspose)              (None, 14, 14, 512)            2359808         enc-block-4-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-bn (BatchNormalization)        (None, 14, 14, 512)            2048            dec-block-3-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-relu (Activation)              (None, 14, 14, 512)            0               dec-block-3-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 14, 14, 768)            0               enc-block-3-conv2-relu[0][0]                   
                                                                                             dec-block-3-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1 (SeparableConv2D)           (None, 14, 14, 256)            203776          concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-bn (BatchNormalization)     (None, 14, 14, 256)            1024            dec-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-relu (Activation)           (None, 14, 14, 256)            0               dec-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2 (SeparableConv2D)           (None, 14, 14, 256)            68096           dec-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip (SeparableConv2D)       (None, 14, 14, 256)            203776          concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-bn (BatchNormalization)     (None, 14, 14, 256)            1024            dec-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip-bn (BatchNormalization) (None, 14, 14, 256)            1024            dec-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-3-residual (Add)                    (None, 14, 14, 256)            0               dec-block-3-conv2-bn[0][0]                     
                                                                                             dec-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-relu (Activation)           (None, 14, 14, 256)            0               dec-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-UP (Conv2DTranspose)              (None, 28, 28, 256)            590080          dec-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-bn (BatchNormalization)        (None, 28, 28, 256)            1024            dec-block-2-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-relu (Activation)              (None, 28, 28, 256)            0               dec-block-2-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 28, 28, 384)            0               enc-block-2-conv2-relu[0][0]                   
                                                                                             dec-block-2-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1 (SeparableConv2D)           (None, 28, 28, 128)            52736           concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-bn (BatchNormalization)     (None, 28, 28, 128)            512             dec-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-relu (Activation)           (None, 28, 28, 128)            0               dec-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2 (SeparableConv2D)           (None, 28, 28, 128)            17664           dec-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip (SeparableConv2D)       (None, 28, 28, 128)            52736           concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-bn (BatchNormalization)     (None, 28, 28, 128)            512             dec-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip-bn (BatchNormalization) (None, 28, 28, 128)            512             dec-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-2-residual (Add)                    (None, 28, 28, 128)            0               dec-block-2-conv2-bn[0][0]                     
                                                                                             dec-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-relu (Activation)           (None, 28, 28, 128)            0               dec-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-UP (Conv2DTranspose)              (None, 56, 56, 128)            147584          dec-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-bn (BatchNormalization)        (None, 56, 56, 128)            512             dec-block-1-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-relu (Activation)              (None, 56, 56, 128)            0               dec-block-1-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 56, 56, 192)            0               enc-block-1-conv2-relu[0][0]                   
                                                                                             dec-block-1-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1 (SeparableConv2D)           (None, 56, 56, 64)             14080           concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-bn (BatchNormalization)     (None, 56, 56, 64)             256             dec-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-relu (Activation)           (None, 56, 56, 64)             0               dec-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2 (SeparableConv2D)           (None, 56, 56, 64)             4736            dec-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip (SeparableConv2D)       (None, 56, 56, 64)             14080           concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-bn (BatchNormalization)     (None, 56, 56, 64)             256             dec-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip-bn (BatchNormalization) (None, 56, 56, 64)             256             dec-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-1-residual (Add)                    (None, 56, 56, 64)             0               dec-block-1-conv2-bn[0][0]                     
                                                                                             dec-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-relu (Activation)           (None, 56, 56, 64)             0               dec-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-UP (Conv2DTranspose)              (None, 112, 112, 64)           36928           dec-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-bn (BatchNormalization)        (None, 112, 112, 64)           256             dec-block-0-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-relu (Activation)              (None, 112, 112, 64)           0               dec-block-0-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 112, 112, 96)           0               enc-block-0-conv2-relu[0][0]                   
                                                                                             dec-block-0-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1 (SeparableConv2D)           (None, 112, 112, 32)           3968            concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-bn (BatchNormalization)     (None, 112, 112, 32)           128             dec-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-relu (Activation)           (None, 112, 112, 32)           0               dec-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2 (SeparableConv2D)           (None, 112, 112, 32)           1344            dec-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip (SeparableConv2D)       (None, 112, 112, 32)           3968            concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-bn (BatchNormalization)     (None, 112, 112, 32)           128             dec-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip-bn (BatchNormalization) (None, 112, 112, 32)           128             dec-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-0-residual (Add)                    (None, 112, 112, 32)           0               dec-block-0-conv2-bn[0][0]                     
                                                                                             dec-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-relu (Activation)           (None, 112, 112, 32)           0               dec-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 112, 112, 3)            99              dec-block-0-conv2-relu[0][0]                   
============================================================================================================================================
Total params: 5,032,365
Trainable params: 5,021,645
Non-trainable params: 10,720
____________________________________________________________________________________________________________________________________________
