Model: "unet-2d.vanilla00.000.1605-801-777"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input_1 (InputLayer)                          [(None, 224, 224, 1)]          0                                                              
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv1 (SeparableConv2D)       (None, 224, 224, 6)            21              input_1[0][0]                                  
____________________________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)      (None, 224, 224, 6)            24              encoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation (Activation)                       (None, 224, 224, 6)            0               batch_normalization[0][0]                      
____________________________________________________________________________________________________________________________________________
dropout (Dropout)                             (None, 224, 224, 6)            0               activation[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv2 (SeparableConv2D)       (None, 224, 224, 12)           138             dropout[0][0]                                  
____________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)    (None, 224, 224, 12)           48              encoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv-skip (SeparableConv2D)   (None, 224, 224, 12)           33              input_1[0][0]                                  
____________________________________________________________________________________________________________________________________________
add (Add)                                     (None, 224, 224, 12)           0               batch_normalization_1[0][0]                    
                                                                                             encoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_1 (Activation)                     (None, 224, 224, 12)           0               add[0][0]                                      
____________________________________________________________________________________________________________________________________________
dropout_1 (Dropout)                           (None, 224, 224, 12)           0               activation_1[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-0-DOWN (Conv2D)                 (None, 112, 112, 12)           1308            dropout_1[0][0]                                
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv1 (SeparableConv2D)       (None, 112, 112, 12)           264             encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)    (None, 112, 112, 12)           48              encoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_2 (Activation)                     (None, 112, 112, 12)           0               batch_normalization_2[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_2 (Dropout)                           (None, 112, 112, 12)           0               activation_2[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv2 (SeparableConv2D)       (None, 112, 112, 24)           420             dropout_2[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)    (None, 112, 112, 24)           96              encoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv-skip (SeparableConv2D)   (None, 112, 112, 24)           420             encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_1 (Add)                                   (None, 112, 112, 24)           0               batch_normalization_3[0][0]                    
                                                                                             encoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_3 (Activation)                     (None, 112, 112, 24)           0               add_1[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_3 (Dropout)                           (None, 112, 112, 24)           0               activation_3[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-1-DOWN (Conv2D)                 (None, 56, 56, 24)             5208            dropout_3[0][0]                                
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv1 (SeparableConv2D)       (None, 56, 56, 24)             816             encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)    (None, 56, 56, 24)             96              encoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_4 (Activation)                     (None, 56, 56, 24)             0               batch_normalization_4[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_4 (Dropout)                           (None, 56, 56, 24)             0               activation_4[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv2 (SeparableConv2D)       (None, 56, 56, 48)             1416            dropout_4[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)    (None, 56, 56, 48)             192             encoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv-skip (SeparableConv2D)   (None, 56, 56, 48)             1416            encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_2 (Add)                                   (None, 56, 56, 48)             0               batch_normalization_5[0][0]                    
                                                                                             encoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_5 (Activation)                     (None, 56, 56, 48)             0               add_2[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_5 (Dropout)                           (None, 56, 56, 48)             0               activation_5[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-2-DOWN (Conv2D)                 (None, 28, 28, 48)             20784           dropout_5[0][0]                                
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv1 (SeparableConv2D)       (None, 28, 28, 48)             2784            encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)    (None, 28, 28, 48)             192             encoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_6 (Activation)                     (None, 28, 28, 48)             0               batch_normalization_6[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_6 (Dropout)                           (None, 28, 28, 48)             0               activation_6[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv2 (SeparableConv2D)       (None, 28, 28, 96)             5136            dropout_6[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)    (None, 28, 28, 96)             384             encoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv-skip (SeparableConv2D)   (None, 28, 28, 96)             5136            encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_3 (Add)                                   (None, 28, 28, 96)             0               batch_normalization_7[0][0]                    
                                                                                             encoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_7 (Activation)                     (None, 28, 28, 96)             0               add_3[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_7 (Dropout)                           (None, 28, 28, 96)             0               activation_7[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-3-DOWN (Conv2D)                 (None, 14, 14, 96)             83040           dropout_7[0][0]                                
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv1 (SeparableConv2D)       (None, 14, 14, 96)             10176           encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)    (None, 14, 14, 96)             384             encoder-block-4-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_8 (Activation)                     (None, 14, 14, 96)             0               batch_normalization_8[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_8 (Dropout)                           (None, 14, 14, 96)             0               activation_8[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv2 (SeparableConv2D)       (None, 14, 14, 192)            19488           dropout_8[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)    (None, 14, 14, 192)            768             encoder-block-4-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv-skip (SeparableConv2D)   (None, 14, 14, 192)            19488           encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_4 (Add)                                   (None, 14, 14, 192)            0               batch_normalization_9[0][0]                    
                                                                                             encoder-block-4-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_9 (Activation)                     (None, 14, 14, 192)            0               add_4[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_9 (Dropout)                           (None, 14, 14, 192)            0               activation_9[0][0]                             
____________________________________________________________________________________________________________________________________________
decoder-block-3-UP (Conv2DTranspose)          (None, 28, 28, 192)            331968          dropout_9[0][0]                                
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 28, 28, 288)            0               dropout_7[0][0]                                
                                                                                             decoder-block-3-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv1 (SeparableConv2D)       (None, 28, 28, 96)             30336           concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalization)   (None, 28, 28, 96)             384             decoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_10 (Activation)                    (None, 28, 28, 96)             0               batch_normalization_10[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_10 (Dropout)                          (None, 28, 28, 96)             0               activation_10[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv2 (SeparableConv2D)       (None, 28, 28, 96)             10176           dropout_10[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_11 (BatchNormalization)   (None, 28, 28, 96)             384             decoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv-skip (SeparableConv2D)   (None, 28, 28, 96)             30336           concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
add_5 (Add)                                   (None, 28, 28, 96)             0               batch_normalization_11[0][0]                   
                                                                                             decoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_11 (Activation)                    (None, 28, 28, 96)             0               add_5[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_11 (Dropout)                          (None, 28, 28, 96)             0               activation_11[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-UP (Conv2DTranspose)          (None, 56, 56, 96)             83040           dropout_11[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 56, 56, 144)            0               dropout_5[0][0]                                
                                                                                             decoder-block-2-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv1 (SeparableConv2D)       (None, 56, 56, 48)             8256            concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_12 (BatchNormalization)   (None, 56, 56, 48)             192             decoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_12 (Activation)                    (None, 56, 56, 48)             0               batch_normalization_12[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_12 (Dropout)                          (None, 56, 56, 48)             0               activation_12[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv2 (SeparableConv2D)       (None, 56, 56, 48)             2784            dropout_12[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_13 (BatchNormalization)   (None, 56, 56, 48)             192             decoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv-skip (SeparableConv2D)   (None, 56, 56, 48)             8256            concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
add_6 (Add)                                   (None, 56, 56, 48)             0               batch_normalization_13[0][0]                   
                                                                                             decoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_13 (Activation)                    (None, 56, 56, 48)             0               add_6[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_13 (Dropout)                          (None, 56, 56, 48)             0               activation_13[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-UP (Conv2DTranspose)          (None, 112, 112, 48)           20784           dropout_13[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 112, 112, 72)           0               dropout_3[0][0]                                
                                                                                             decoder-block-1-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv1 (SeparableConv2D)       (None, 112, 112, 24)           2400            concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_14 (BatchNormalization)   (None, 112, 112, 24)           96              decoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_14 (Activation)                    (None, 112, 112, 24)           0               batch_normalization_14[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_14 (Dropout)                          (None, 112, 112, 24)           0               activation_14[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv2 (SeparableConv2D)       (None, 112, 112, 24)           816             dropout_14[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_15 (BatchNormalization)   (None, 112, 112, 24)           96              decoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv-skip (SeparableConv2D)   (None, 112, 112, 24)           2400            concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
add_7 (Add)                                   (None, 112, 112, 24)           0               batch_normalization_15[0][0]                   
                                                                                             decoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_15 (Activation)                    (None, 112, 112, 24)           0               add_7[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_15 (Dropout)                          (None, 112, 112, 24)           0               activation_15[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-UP (Conv2DTranspose)          (None, 224, 224, 24)           5208            dropout_15[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 224, 224, 36)           0               dropout_1[0][0]                                
                                                                                             decoder-block-0-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv1 (SeparableConv2D)       (None, 224, 224, 12)           768             concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_16 (BatchNormalization)   (None, 224, 224, 12)           48              decoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_16 (Activation)                    (None, 224, 224, 12)           0               batch_normalization_16[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_16 (Dropout)                          (None, 224, 224, 12)           0               activation_16[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv2 (SeparableConv2D)       (None, 224, 224, 12)           264             dropout_16[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_17 (BatchNormalization)   (None, 224, 224, 12)           48              decoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv-skip (SeparableConv2D)   (None, 224, 224, 12)           768             concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
add_8 (Add)                                   (None, 224, 224, 12)           0               batch_normalization_17[0][0]                   
                                                                                             decoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_17 (Activation)                    (None, 224, 224, 12)           0               add_8[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_17 (Dropout)                          (None, 224, 224, 12)           0               activation_17[0][0]                            
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 224, 224, 3)            39              dropout_17[0][0]                               
============================================================================================================================================
Total params: 719,763
Trainable params: 717,927
Non-trainable params: 1,836
____________________________________________________________________________________________________________________________________________
