Model: "unet2d.crop48-f16.fold000.1607-530-580"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input (InputLayer)                            [(None, 48, 48, 1)]            0                                                              
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1 (Conv2D)                    (None, 48, 48, 16)             160             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-bn (BatchNormalization)     (None, 48, 48, 16)             64              enc-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-relu (Activation)           (None, 48, 48, 16)             0               enc-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2 (Conv2D)                    (None, 48, 48, 32)             4640            enc-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip (Conv2D)                (None, 48, 48, 32)             320             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-bn (BatchNormalization)     (None, 48, 48, 32)             128             enc-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip-bn (BatchNormalization) (None, 48, 48, 32)             128             enc-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-0-residual (Add)                    (None, 48, 48, 32)             0               enc-block-0-conv2-bn[0][0]                     
                                                                                             enc-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-relu (Activation)           (None, 48, 48, 32)             0               enc-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN (Conv2D)                     (None, 24, 24, 32)             9248            enc-block-0-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-bn (BatchNormalization)      (None, 24, 24, 32)             128             enc-block-0-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-relu (Activation)            (None, 24, 24, 32)             0               enc-block-0-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1 (Conv2D)                    (None, 24, 24, 32)             9248            enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-bn (BatchNormalization)     (None, 24, 24, 32)             128             enc-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-relu (Activation)           (None, 24, 24, 32)             0               enc-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2 (Conv2D)                    (None, 24, 24, 64)             18496           enc-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip (Conv2D)                (None, 24, 24, 64)             18496           enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-bn (BatchNormalization)     (None, 24, 24, 64)             256             enc-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip-bn (BatchNormalization) (None, 24, 24, 64)             256             enc-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-residual (Add)                    (None, 24, 24, 64)             0               enc-block-1-conv2-bn[0][0]                     
                                                                                             enc-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-relu (Activation)           (None, 24, 24, 64)             0               enc-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN (Conv2D)                     (None, 12, 12, 64)             36928           enc-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-bn (BatchNormalization)      (None, 12, 12, 64)             256             enc-block-1-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-relu (Activation)            (None, 12, 12, 64)             0               enc-block-1-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1 (Conv2D)                    (None, 12, 12, 64)             36928           enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-bn (BatchNormalization)     (None, 12, 12, 64)             256             enc-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-relu (Activation)           (None, 12, 12, 64)             0               enc-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2 (Conv2D)                    (None, 12, 12, 128)            73856           enc-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip (Conv2D)                (None, 12, 12, 128)            73856           enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-bn (BatchNormalization)     (None, 12, 12, 128)            512             enc-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip-bn (BatchNormalization) (None, 12, 12, 128)            512             enc-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-residual (Add)                    (None, 12, 12, 128)            0               enc-block-2-conv2-bn[0][0]                     
                                                                                             enc-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-relu (Activation)           (None, 12, 12, 128)            0               enc-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN (Conv2D)                     (None, 6, 6, 128)              147584          enc-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-bn (BatchNormalization)      (None, 6, 6, 128)              512             enc-block-2-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-relu (Activation)            (None, 6, 6, 128)              0               enc-block-2-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1 (Conv2D)                    (None, 6, 6, 128)              147584          enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-bn (BatchNormalization)     (None, 6, 6, 128)              512             enc-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-relu (Activation)           (None, 6, 6, 128)              0               enc-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2 (Conv2D)                    (None, 6, 6, 256)              295168          enc-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip (Conv2D)                (None, 6, 6, 256)              295168          enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-bn (BatchNormalization)     (None, 6, 6, 256)              1024            enc-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip-bn (BatchNormalization) (None, 6, 6, 256)              1024            enc-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-residual (Add)                    (None, 6, 6, 256)              0               enc-block-3-conv2-bn[0][0]                     
                                                                                             enc-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-relu (Activation)           (None, 6, 6, 256)              0               enc-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN (Conv2D)                     (None, 3, 3, 256)              590080          enc-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-bn (BatchNormalization)      (None, 3, 3, 256)              1024            enc-block-3-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-relu (Activation)            (None, 3, 3, 256)              0               enc-block-3-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1 (Conv2D)                    (None, 3, 3, 256)              590080          enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-bn (BatchNormalization)     (None, 3, 3, 256)              1024            enc-block-4-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-relu (Activation)           (None, 3, 3, 256)              0               enc-block-4-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2 (Conv2D)                    (None, 3, 3, 512)              1180160         enc-block-4-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip (Conv2D)                (None, 3, 3, 512)              1180160         enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-bn (BatchNormalization)     (None, 3, 3, 512)              2048            enc-block-4-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip-bn (BatchNormalization) (None, 3, 3, 512)              2048            enc-block-4-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-residual (Add)                    (None, 3, 3, 512)              0               enc-block-4-conv2-bn[0][0]                     
                                                                                             enc-block-4-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-relu (Activation)           (None, 3, 3, 512)              0               enc-block-4-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-UP (Conv2DTranspose)              (None, 6, 6, 512)              2359808         enc-block-4-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-bn (BatchNormalization)        (None, 6, 6, 512)              2048            dec-block-3-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-relu (Activation)              (None, 6, 6, 512)              0               dec-block-3-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 6, 6, 768)              0               enc-block-3-conv2-relu[0][0]                   
                                                                                             dec-block-3-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1 (Conv2D)                    (None, 6, 6, 256)              1769728         concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-bn (BatchNormalization)     (None, 6, 6, 256)              1024            dec-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-relu (Activation)           (None, 6, 6, 256)              0               dec-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2 (Conv2D)                    (None, 6, 6, 256)              590080          dec-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip (Conv2D)                (None, 6, 6, 256)              1769728         concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-bn (BatchNormalization)     (None, 6, 6, 256)              1024            dec-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip-bn (BatchNormalization) (None, 6, 6, 256)              1024            dec-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-3-residual (Add)                    (None, 6, 6, 256)              0               dec-block-3-conv2-bn[0][0]                     
                                                                                             dec-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-relu (Activation)           (None, 6, 6, 256)              0               dec-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-UP (Conv2DTranspose)              (None, 12, 12, 256)            590080          dec-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-bn (BatchNormalization)        (None, 12, 12, 256)            1024            dec-block-2-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-relu (Activation)              (None, 12, 12, 256)            0               dec-block-2-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 12, 12, 384)            0               enc-block-2-conv2-relu[0][0]                   
                                                                                             dec-block-2-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1 (Conv2D)                    (None, 12, 12, 128)            442496          concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-bn (BatchNormalization)     (None, 12, 12, 128)            512             dec-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-relu (Activation)           (None, 12, 12, 128)            0               dec-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2 (Conv2D)                    (None, 12, 12, 128)            147584          dec-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip (Conv2D)                (None, 12, 12, 128)            442496          concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-bn (BatchNormalization)     (None, 12, 12, 128)            512             dec-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip-bn (BatchNormalization) (None, 12, 12, 128)            512             dec-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-2-residual (Add)                    (None, 12, 12, 128)            0               dec-block-2-conv2-bn[0][0]                     
                                                                                             dec-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-relu (Activation)           (None, 12, 12, 128)            0               dec-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-UP (Conv2DTranspose)              (None, 24, 24, 128)            147584          dec-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-bn (BatchNormalization)        (None, 24, 24, 128)            512             dec-block-1-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-relu (Activation)              (None, 24, 24, 128)            0               dec-block-1-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 24, 24, 192)            0               enc-block-1-conv2-relu[0][0]                   
                                                                                             dec-block-1-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1 (Conv2D)                    (None, 24, 24, 64)             110656          concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-bn (BatchNormalization)     (None, 24, 24, 64)             256             dec-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-relu (Activation)           (None, 24, 24, 64)             0               dec-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2 (Conv2D)                    (None, 24, 24, 64)             36928           dec-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip (Conv2D)                (None, 24, 24, 64)             110656          concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-bn (BatchNormalization)     (None, 24, 24, 64)             256             dec-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip-bn (BatchNormalization) (None, 24, 24, 64)             256             dec-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-1-residual (Add)                    (None, 24, 24, 64)             0               dec-block-1-conv2-bn[0][0]                     
                                                                                             dec-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-relu (Activation)           (None, 24, 24, 64)             0               dec-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-UP (Conv2DTranspose)              (None, 48, 48, 64)             36928           dec-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-bn (BatchNormalization)        (None, 48, 48, 64)             256             dec-block-0-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-relu (Activation)              (None, 48, 48, 64)             0               dec-block-0-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 48, 48, 96)             0               enc-block-0-conv2-relu[0][0]                   
                                                                                             dec-block-0-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1 (Conv2D)                    (None, 48, 48, 32)             27680           concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-bn (BatchNormalization)     (None, 48, 48, 32)             128             dec-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-relu (Activation)           (None, 48, 48, 32)             0               dec-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2 (Conv2D)                    (None, 48, 48, 32)             9248            dec-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip (Conv2D)                (None, 48, 48, 32)             27680           concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-bn (BatchNormalization)     (None, 48, 48, 32)             128             dec-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip-bn (BatchNormalization) (None, 48, 48, 32)             128             dec-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-0-residual (Add)                    (None, 48, 48, 32)             0               dec-block-0-conv2-bn[0][0]                     
                                                                                             dec-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-relu (Activation)           (None, 48, 48, 32)             0               dec-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 48, 48, 3)              99              dec-block-0-conv2-relu[0][0]                   
============================================================================================================================================
Total params: 13,349,059
Trainable params: 13,338,339
Non-trainable params: 10,720
____________________________________________________________________________________________________________________________________________
