Model: "unet3d.vanilla03-f08.fold000.1606-842-005"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input (InputLayer)                            [(None, 48, 48, 48, 1)]        0                                                              
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1 (Conv3D)                    (None, 48, 48, 48, 8)          224             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-bn (BatchNormalization)     (None, 48, 48, 48, 8)          32              enc-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-relu (Activation)           (None, 48, 48, 48, 8)          0               enc-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2 (Conv3D)                    (None, 48, 48, 48, 16)         3472            enc-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip (Conv3D)                (None, 48, 48, 48, 16)         448             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-bn (BatchNormalization)     (None, 48, 48, 48, 16)         64              enc-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip-bn (BatchNormalization) (None, 48, 48, 48, 16)         64              enc-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-0-residual (Add)                    (None, 48, 48, 48, 16)         0               enc-block-0-conv2-bn[0][0]                     
                                                                                             enc-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-relu (Activation)           (None, 48, 48, 48, 16)         0               enc-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN (Conv3D)                     (None, 24, 24, 24, 16)         6928            enc-block-0-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-bn (BatchNormalization)      (None, 24, 24, 24, 16)         64              enc-block-0-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-relu (Activation)            (None, 24, 24, 24, 16)         0               enc-block-0-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1 (Conv3D)                    (None, 24, 24, 24, 16)         6928            enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-bn (BatchNormalization)     (None, 24, 24, 24, 16)         64              enc-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-relu (Activation)           (None, 24, 24, 24, 16)         0               enc-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2 (Conv3D)                    (None, 24, 24, 24, 32)         13856           enc-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip (Conv3D)                (None, 24, 24, 24, 32)         13856           enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-bn (BatchNormalization)     (None, 24, 24, 24, 32)         128             enc-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip-bn (BatchNormalization) (None, 24, 24, 24, 32)         128             enc-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-residual (Add)                    (None, 24, 24, 24, 32)         0               enc-block-1-conv2-bn[0][0]                     
                                                                                             enc-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-relu (Activation)           (None, 24, 24, 24, 32)         0               enc-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN (Conv3D)                     (None, 12, 12, 12, 32)         27680           enc-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-bn (BatchNormalization)      (None, 12, 12, 12, 32)         128             enc-block-1-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-relu (Activation)            (None, 12, 12, 12, 32)         0               enc-block-1-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1 (Conv3D)                    (None, 12, 12, 12, 32)         27680           enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-bn (BatchNormalization)     (None, 12, 12, 12, 32)         128             enc-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-relu (Activation)           (None, 12, 12, 12, 32)         0               enc-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2 (Conv3D)                    (None, 12, 12, 12, 64)         55360           enc-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip (Conv3D)                (None, 12, 12, 12, 64)         55360           enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-bn (BatchNormalization)     (None, 12, 12, 12, 64)         256             enc-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip-bn (BatchNormalization) (None, 12, 12, 12, 64)         256             enc-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-residual (Add)                    (None, 12, 12, 12, 64)         0               enc-block-2-conv2-bn[0][0]                     
                                                                                             enc-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-relu (Activation)           (None, 12, 12, 12, 64)         0               enc-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN (Conv3D)                     (None, 6, 6, 6, 64)            110656          enc-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-bn (BatchNormalization)      (None, 6, 6, 6, 64)            256             enc-block-2-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-relu (Activation)            (None, 6, 6, 6, 64)            0               enc-block-2-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1 (Conv3D)                    (None, 6, 6, 6, 64)            110656          enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-bn (BatchNormalization)     (None, 6, 6, 6, 64)            256             enc-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-relu (Activation)           (None, 6, 6, 6, 64)            0               enc-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2 (Conv3D)                    (None, 6, 6, 6, 128)           221312          enc-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip (Conv3D)                (None, 6, 6, 6, 128)           221312          enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-bn (BatchNormalization)     (None, 6, 6, 6, 128)           512             enc-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip-bn (BatchNormalization) (None, 6, 6, 6, 128)           512             enc-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-residual (Add)                    (None, 6, 6, 6, 128)           0               enc-block-3-conv2-bn[0][0]                     
                                                                                             enc-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-relu (Activation)           (None, 6, 6, 6, 128)           0               enc-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN (Conv3D)                     (None, 3, 3, 3, 128)           442496          enc-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-bn (BatchNormalization)      (None, 3, 3, 3, 128)           512             enc-block-3-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-relu (Activation)            (None, 3, 3, 3, 128)           0               enc-block-3-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1 (Conv3D)                    (None, 3, 3, 3, 128)           442496          enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-bn (BatchNormalization)     (None, 3, 3, 3, 128)           512             enc-block-4-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-relu (Activation)           (None, 3, 3, 3, 128)           0               enc-block-4-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2 (Conv3D)                    (None, 3, 3, 3, 256)           884992          enc-block-4-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip (Conv3D)                (None, 3, 3, 3, 256)           884992          enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-bn (BatchNormalization)     (None, 3, 3, 3, 256)           1024            enc-block-4-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip-bn (BatchNormalization) (None, 3, 3, 3, 256)           1024            enc-block-4-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-residual (Add)                    (None, 3, 3, 3, 256)           0               enc-block-4-conv2-bn[0][0]                     
                                                                                             enc-block-4-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-relu (Activation)           (None, 3, 3, 3, 256)           0               enc-block-4-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-UP (Conv3DTranspose)              (None, 6, 6, 6, 256)           1769728         enc-block-4-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-bn (BatchNormalization)        (None, 6, 6, 6, 256)           1024            dec-block-3-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-relu (Activation)              (None, 6, 6, 6, 256)           0               dec-block-3-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 6, 6, 6, 384)           0               enc-block-3-conv2-relu[0][0]                   
                                                                                             dec-block-3-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1 (Conv3D)                    (None, 6, 6, 6, 128)           1327232         concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-bn (BatchNormalization)     (None, 6, 6, 6, 128)           512             dec-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-relu (Activation)           (None, 6, 6, 6, 128)           0               dec-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2 (Conv3D)                    (None, 6, 6, 6, 128)           442496          dec-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip (Conv3D)                (None, 6, 6, 6, 128)           1327232         concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-bn (BatchNormalization)     (None, 6, 6, 6, 128)           512             dec-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip-bn (BatchNormalization) (None, 6, 6, 6, 128)           512             dec-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-3-residual (Add)                    (None, 6, 6, 6, 128)           0               dec-block-3-conv2-bn[0][0]                     
                                                                                             dec-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-relu (Activation)           (None, 6, 6, 6, 128)           0               dec-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-UP (Conv3DTranspose)              (None, 12, 12, 12, 128)        442496          dec-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-bn (BatchNormalization)        (None, 12, 12, 12, 128)        512             dec-block-2-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-relu (Activation)              (None, 12, 12, 12, 128)        0               dec-block-2-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 12, 12, 12, 192)        0               enc-block-2-conv2-relu[0][0]                   
                                                                                             dec-block-2-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1 (Conv3D)                    (None, 12, 12, 12, 64)         331840          concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-bn (BatchNormalization)     (None, 12, 12, 12, 64)         256             dec-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-relu (Activation)           (None, 12, 12, 12, 64)         0               dec-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2 (Conv3D)                    (None, 12, 12, 12, 64)         110656          dec-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip (Conv3D)                (None, 12, 12, 12, 64)         331840          concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-bn (BatchNormalization)     (None, 12, 12, 12, 64)         256             dec-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip-bn (BatchNormalization) (None, 12, 12, 12, 64)         256             dec-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-2-residual (Add)                    (None, 12, 12, 12, 64)         0               dec-block-2-conv2-bn[0][0]                     
                                                                                             dec-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-relu (Activation)           (None, 12, 12, 12, 64)         0               dec-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-UP (Conv3DTranspose)              (None, 24, 24, 24, 64)         110656          dec-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-bn (BatchNormalization)        (None, 24, 24, 24, 64)         256             dec-block-1-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-relu (Activation)              (None, 24, 24, 24, 64)         0               dec-block-1-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 24, 24, 24, 96)         0               enc-block-1-conv2-relu[0][0]                   
                                                                                             dec-block-1-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1 (Conv3D)                    (None, 24, 24, 24, 32)         82976           concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-bn (BatchNormalization)     (None, 24, 24, 24, 32)         128             dec-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-relu (Activation)           (None, 24, 24, 24, 32)         0               dec-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2 (Conv3D)                    (None, 24, 24, 24, 32)         27680           dec-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip (Conv3D)                (None, 24, 24, 24, 32)         82976           concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-bn (BatchNormalization)     (None, 24, 24, 24, 32)         128             dec-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip-bn (BatchNormalization) (None, 24, 24, 24, 32)         128             dec-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-1-residual (Add)                    (None, 24, 24, 24, 32)         0               dec-block-1-conv2-bn[0][0]                     
                                                                                             dec-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-relu (Activation)           (None, 24, 24, 24, 32)         0               dec-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-UP (Conv3DTranspose)              (None, 48, 48, 48, 32)         27680           dec-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-bn (BatchNormalization)        (None, 48, 48, 48, 32)         128             dec-block-0-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-relu (Activation)              (None, 48, 48, 48, 32)         0               dec-block-0-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 48, 48, 48, 48)         0               enc-block-0-conv2-relu[0][0]                   
                                                                                             dec-block-0-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1 (Conv3D)                    (None, 48, 48, 48, 16)         20752           concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-bn (BatchNormalization)     (None, 48, 48, 48, 16)         64              dec-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-relu (Activation)           (None, 48, 48, 48, 16)         0               dec-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2 (Conv3D)                    (None, 48, 48, 48, 16)         6928            dec-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip (Conv3D)                (None, 48, 48, 48, 16)         20752           concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-bn (BatchNormalization)     (None, 48, 48, 48, 16)         64              dec-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip-bn (BatchNormalization) (None, 48, 48, 48, 16)         64              dec-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-0-residual (Add)                    (None, 48, 48, 48, 16)         0               dec-block-0-conv2-bn[0][0]                     
                                                                                             dec-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-relu (Activation)           (None, 48, 48, 48, 16)         0               dec-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
out (Conv3D)                                  (None, 48, 48, 48, 3)          51              dec-block-0-conv2-relu[0][0]                   
============================================================================================================================================
Total params: 10,005,395
Trainable params: 10,000,035
Non-trainable params: 5,360
____________________________________________________________________________________________________________________________________________
