Model: "unet-2d-small.vanilla01.000.1606-236-622"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input_1 (InputLayer)                          [(None, 320, 320, 1)]          0                                                              
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv1 (SeparableConv2D)       (None, 320, 320, 16)           41              input_1[0][0]                                  
____________________________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)      (None, 320, 320, 16)           64              encoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation (Activation)                       (None, 320, 320, 16)           0               batch_normalization[0][0]                      
____________________________________________________________________________________________________________________________________________
dropout (Dropout)                             (None, 320, 320, 16)           0               activation[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv2 (SeparableConv2D)       (None, 320, 320, 32)           688             dropout[0][0]                                  
____________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)    (None, 320, 320, 32)           128             encoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv-skip (SeparableConv2D)   (None, 320, 320, 32)           73              input_1[0][0]                                  
____________________________________________________________________________________________________________________________________________
add (Add)                                     (None, 320, 320, 32)           0               batch_normalization_1[0][0]                    
                                                                                             encoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_1 (Activation)                     (None, 320, 320, 32)           0               add[0][0]                                      
____________________________________________________________________________________________________________________________________________
dropout_1 (Dropout)                           (None, 320, 320, 32)           0               activation_1[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-0-DOWN (Conv2D)                 (None, 160, 160, 32)           9248            dropout_1[0][0]                                
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv1 (SeparableConv2D)       (None, 160, 160, 32)           1344            encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)    (None, 160, 160, 32)           128             encoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_2 (Activation)                     (None, 160, 160, 32)           0               batch_normalization_2[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_2 (Dropout)                           (None, 160, 160, 32)           0               activation_2[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv2 (SeparableConv2D)       (None, 160, 160, 64)           2400            dropout_2[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)    (None, 160, 160, 64)           256             encoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv-skip (SeparableConv2D)   (None, 160, 160, 64)           2400            encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_1 (Add)                                   (None, 160, 160, 64)           0               batch_normalization_3[0][0]                    
                                                                                             encoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_3 (Activation)                     (None, 160, 160, 64)           0               add_1[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_3 (Dropout)                           (None, 160, 160, 64)           0               activation_3[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-1-DOWN (Conv2D)                 (None, 80, 80, 64)             36928           dropout_3[0][0]                                
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv1 (SeparableConv2D)       (None, 80, 80, 64)             4736            encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)    (None, 80, 80, 64)             256             encoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_4 (Activation)                     (None, 80, 80, 64)             0               batch_normalization_4[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_4 (Dropout)                           (None, 80, 80, 64)             0               activation_4[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv2 (SeparableConv2D)       (None, 80, 80, 128)            8896            dropout_4[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)    (None, 80, 80, 128)            512             encoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv-skip (SeparableConv2D)   (None, 80, 80, 128)            8896            encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_2 (Add)                                   (None, 80, 80, 128)            0               batch_normalization_5[0][0]                    
                                                                                             encoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_5 (Activation)                     (None, 80, 80, 128)            0               add_2[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_5 (Dropout)                           (None, 80, 80, 128)            0               activation_5[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-2-DOWN (Conv2D)                 (None, 40, 40, 128)            147584          dropout_5[0][0]                                
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv1 (SeparableConv2D)       (None, 40, 40, 128)            17664           encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)    (None, 40, 40, 128)            512             encoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_6 (Activation)                     (None, 40, 40, 128)            0               batch_normalization_6[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_6 (Dropout)                           (None, 40, 40, 128)            0               activation_6[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv2 (SeparableConv2D)       (None, 40, 40, 256)            34176           dropout_6[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)    (None, 40, 40, 256)            1024            encoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv-skip (SeparableConv2D)   (None, 40, 40, 256)            34176           encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_3 (Add)                                   (None, 40, 40, 256)            0               batch_normalization_7[0][0]                    
                                                                                             encoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_7 (Activation)                     (None, 40, 40, 256)            0               add_3[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_7 (Dropout)                           (None, 40, 40, 256)            0               activation_7[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-3-DOWN (Conv2D)                 (None, 20, 20, 256)            590080          dropout_7[0][0]                                
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv1 (SeparableConv2D)       (None, 20, 20, 256)            68096           encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)    (None, 20, 20, 256)            1024            encoder-block-4-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_8 (Activation)                     (None, 20, 20, 256)            0               batch_normalization_8[0][0]                    
____________________________________________________________________________________________________________________________________________
dropout_8 (Dropout)                           (None, 20, 20, 256)            0               activation_8[0][0]                             
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv2 (SeparableConv2D)       (None, 20, 20, 512)            133888          dropout_8[0][0]                                
____________________________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)    (None, 20, 20, 512)            2048            encoder-block-4-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv-skip (SeparableConv2D)   (None, 20, 20, 512)            133888          encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_4 (Add)                                   (None, 20, 20, 512)            0               batch_normalization_9[0][0]                    
                                                                                             encoder-block-4-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_9 (Activation)                     (None, 20, 20, 512)            0               add_4[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_9 (Dropout)                           (None, 20, 20, 512)            0               activation_9[0][0]                             
____________________________________________________________________________________________________________________________________________
decoder-block-3-UP (Conv2DTranspose)          (None, 40, 40, 512)            2359808         dropout_9[0][0]                                
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 40, 40, 768)            0               dropout_7[0][0]                                
                                                                                             decoder-block-3-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv1 (SeparableConv2D)       (None, 40, 40, 256)            203776          concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalization)   (None, 40, 40, 256)            1024            decoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_10 (Activation)                    (None, 40, 40, 256)            0               batch_normalization_10[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_10 (Dropout)                          (None, 40, 40, 256)            0               activation_10[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv2 (SeparableConv2D)       (None, 40, 40, 256)            68096           dropout_10[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_11 (BatchNormalization)   (None, 40, 40, 256)            1024            decoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv-skip (SeparableConv2D)   (None, 40, 40, 256)            203776          concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
add_5 (Add)                                   (None, 40, 40, 256)            0               batch_normalization_11[0][0]                   
                                                                                             decoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_11 (Activation)                    (None, 40, 40, 256)            0               add_5[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_11 (Dropout)                          (None, 40, 40, 256)            0               activation_11[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-UP (Conv2DTranspose)          (None, 80, 80, 256)            590080          dropout_11[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 80, 80, 384)            0               dropout_5[0][0]                                
                                                                                             decoder-block-2-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv1 (SeparableConv2D)       (None, 80, 80, 128)            52736           concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_12 (BatchNormalization)   (None, 80, 80, 128)            512             decoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_12 (Activation)                    (None, 80, 80, 128)            0               batch_normalization_12[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_12 (Dropout)                          (None, 80, 80, 128)            0               activation_12[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv2 (SeparableConv2D)       (None, 80, 80, 128)            17664           dropout_12[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_13 (BatchNormalization)   (None, 80, 80, 128)            512             decoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv-skip (SeparableConv2D)   (None, 80, 80, 128)            52736           concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
add_6 (Add)                                   (None, 80, 80, 128)            0               batch_normalization_13[0][0]                   
                                                                                             decoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_13 (Activation)                    (None, 80, 80, 128)            0               add_6[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_13 (Dropout)                          (None, 80, 80, 128)            0               activation_13[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-UP (Conv2DTranspose)          (None, 160, 160, 128)          147584          dropout_13[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 160, 160, 192)          0               dropout_3[0][0]                                
                                                                                             decoder-block-1-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv1 (SeparableConv2D)       (None, 160, 160, 64)           14080           concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_14 (BatchNormalization)   (None, 160, 160, 64)           256             decoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_14 (Activation)                    (None, 160, 160, 64)           0               batch_normalization_14[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_14 (Dropout)                          (None, 160, 160, 64)           0               activation_14[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv2 (SeparableConv2D)       (None, 160, 160, 64)           4736            dropout_14[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_15 (BatchNormalization)   (None, 160, 160, 64)           256             decoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv-skip (SeparableConv2D)   (None, 160, 160, 64)           14080           concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
add_7 (Add)                                   (None, 160, 160, 64)           0               batch_normalization_15[0][0]                   
                                                                                             decoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_15 (Activation)                    (None, 160, 160, 64)           0               add_7[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_15 (Dropout)                          (None, 160, 160, 64)           0               activation_15[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-UP (Conv2DTranspose)          (None, 320, 320, 64)           36928           dropout_15[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 320, 320, 96)           0               dropout_1[0][0]                                
                                                                                             decoder-block-0-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv1 (SeparableConv2D)       (None, 320, 320, 32)           3968            concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_16 (BatchNormalization)   (None, 320, 320, 32)           128             decoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_16 (Activation)                    (None, 320, 320, 32)           0               batch_normalization_16[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_16 (Dropout)                          (None, 320, 320, 32)           0               activation_16[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv2 (SeparableConv2D)       (None, 320, 320, 32)           1344            dropout_16[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_17 (BatchNormalization)   (None, 320, 320, 32)           128             decoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv-skip (SeparableConv2D)   (None, 320, 320, 32)           3968            concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
add_8 (Add)                                   (None, 320, 320, 32)           0               batch_normalization_17[0][0]                   
                                                                                             decoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_17 (Activation)                    (None, 320, 320, 32)           0               add_8[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_17 (Dropout)                          (None, 320, 320, 32)           0               activation_17[0][0]                            
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 320, 320, 3)            99              dropout_17[0][0]                               
============================================================================================================================================
Total params: 5,020,453
Trainable params: 5,015,557
Non-trainable params: 4,896
____________________________________________________________________________________________________________________________________________
