Model: "unet-2d.vanilla00.000.1605-796-732"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input_5 (InputLayer)                          [(None, 224, 224, 1)]          0                                                              
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv1 (SeparableConv2D)       (None, 224, 224, 6)            21              input_5[0][0]                                  
____________________________________________________________________________________________________________________________________________
batch_normalization_72 (BatchNormalization)   (None, 224, 224, 6)            24              encoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_72 (Activation)                    (None, 224, 224, 6)            0               batch_normalization_72[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_72 (Dropout)                          (None, 224, 224, 6)            0               activation_72[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv2 (SeparableConv2D)       (None, 224, 224, 12)           138             dropout_72[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_73 (BatchNormalization)   (None, 224, 224, 12)           48              encoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv-skip (SeparableConv2D)   (None, 224, 224, 12)           33              input_5[0][0]                                  
____________________________________________________________________________________________________________________________________________
add_36 (Add)                                  (None, 224, 224, 12)           0               batch_normalization_73[0][0]                   
                                                                                             encoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_73 (Activation)                    (None, 224, 224, 12)           0               add_36[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_73 (Dropout)                          (None, 224, 224, 12)           0               activation_73[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-0-DOWN (Conv2D)                 (None, 112, 112, 12)           1308            dropout_73[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv1 (SeparableConv2D)       (None, 112, 112, 12)           264             encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_74 (BatchNormalization)   (None, 112, 112, 12)           48              encoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_74 (Activation)                    (None, 112, 112, 12)           0               batch_normalization_74[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_74 (Dropout)                          (None, 112, 112, 12)           0               activation_74[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv2 (SeparableConv2D)       (None, 112, 112, 24)           420             dropout_74[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_75 (BatchNormalization)   (None, 112, 112, 24)           96              encoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv-skip (SeparableConv2D)   (None, 112, 112, 24)           420             encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_37 (Add)                                  (None, 112, 112, 24)           0               batch_normalization_75[0][0]                   
                                                                                             encoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_75 (Activation)                    (None, 112, 112, 24)           0               add_37[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_75 (Dropout)                          (None, 112, 112, 24)           0               activation_75[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-1-DOWN (Conv2D)                 (None, 56, 56, 24)             5208            dropout_75[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv1 (SeparableConv2D)       (None, 56, 56, 24)             816             encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_76 (BatchNormalization)   (None, 56, 56, 24)             96              encoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_76 (Activation)                    (None, 56, 56, 24)             0               batch_normalization_76[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_76 (Dropout)                          (None, 56, 56, 24)             0               activation_76[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv2 (SeparableConv2D)       (None, 56, 56, 48)             1416            dropout_76[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_77 (BatchNormalization)   (None, 56, 56, 48)             192             encoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv-skip (SeparableConv2D)   (None, 56, 56, 48)             1416            encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_38 (Add)                                  (None, 56, 56, 48)             0               batch_normalization_77[0][0]                   
                                                                                             encoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_77 (Activation)                    (None, 56, 56, 48)             0               add_38[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_77 (Dropout)                          (None, 56, 56, 48)             0               activation_77[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-2-DOWN (Conv2D)                 (None, 28, 28, 48)             20784           dropout_77[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv1 (SeparableConv2D)       (None, 28, 28, 48)             2784            encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_78 (BatchNormalization)   (None, 28, 28, 48)             192             encoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_78 (Activation)                    (None, 28, 28, 48)             0               batch_normalization_78[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_78 (Dropout)                          (None, 28, 28, 48)             0               activation_78[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv2 (SeparableConv2D)       (None, 28, 28, 96)             5136            dropout_78[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_79 (BatchNormalization)   (None, 28, 28, 96)             384             encoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv-skip (SeparableConv2D)   (None, 28, 28, 96)             5136            encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_39 (Add)                                  (None, 28, 28, 96)             0               batch_normalization_79[0][0]                   
                                                                                             encoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_79 (Activation)                    (None, 28, 28, 96)             0               add_39[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_79 (Dropout)                          (None, 28, 28, 96)             0               activation_79[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-3-DOWN (Conv2D)                 (None, 14, 14, 96)             83040           dropout_79[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv1 (SeparableConv2D)       (None, 14, 14, 96)             10176           encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_80 (BatchNormalization)   (None, 14, 14, 96)             384             encoder-block-4-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_80 (Activation)                    (None, 14, 14, 96)             0               batch_normalization_80[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_80 (Dropout)                          (None, 14, 14, 96)             0               activation_80[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv2 (SeparableConv2D)       (None, 14, 14, 192)            19488           dropout_80[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_81 (BatchNormalization)   (None, 14, 14, 192)            768             encoder-block-4-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv-skip (SeparableConv2D)   (None, 14, 14, 192)            19488           encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_40 (Add)                                  (None, 14, 14, 192)            0               batch_normalization_81[0][0]                   
                                                                                             encoder-block-4-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_81 (Activation)                    (None, 14, 14, 192)            0               add_40[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_81 (Dropout)                          (None, 14, 14, 192)            0               activation_81[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-3-UP (Conv2DTranspose)          (None, 28, 28, 192)            331968          dropout_81[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_16 (Concatenate)                  (None, 28, 28, 288)            0               dropout_79[0][0]                               
                                                                                             decoder-block-3-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv1 (SeparableConv2D)       (None, 28, 28, 96)             30336           concatenate_16[0][0]                           
____________________________________________________________________________________________________________________________________________
batch_normalization_82 (BatchNormalization)   (None, 28, 28, 96)             384             decoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_82 (Activation)                    (None, 28, 28, 96)             0               batch_normalization_82[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_82 (Dropout)                          (None, 28, 28, 96)             0               activation_82[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv2 (SeparableConv2D)       (None, 28, 28, 96)             10176           dropout_82[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_83 (BatchNormalization)   (None, 28, 28, 96)             384             decoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv-skip (SeparableConv2D)   (None, 28, 28, 96)             30336           concatenate_16[0][0]                           
____________________________________________________________________________________________________________________________________________
add_41 (Add)                                  (None, 28, 28, 96)             0               batch_normalization_83[0][0]                   
                                                                                             decoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_83 (Activation)                    (None, 28, 28, 96)             0               add_41[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_83 (Dropout)                          (None, 28, 28, 96)             0               activation_83[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-UP (Conv2DTranspose)          (None, 56, 56, 96)             83040           dropout_83[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_17 (Concatenate)                  (None, 56, 56, 144)            0               dropout_77[0][0]                               
                                                                                             decoder-block-2-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv1 (SeparableConv2D)       (None, 56, 56, 48)             8256            concatenate_17[0][0]                           
____________________________________________________________________________________________________________________________________________
batch_normalization_84 (BatchNormalization)   (None, 56, 56, 48)             192             decoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_84 (Activation)                    (None, 56, 56, 48)             0               batch_normalization_84[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_84 (Dropout)                          (None, 56, 56, 48)             0               activation_84[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv2 (SeparableConv2D)       (None, 56, 56, 48)             2784            dropout_84[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_85 (BatchNormalization)   (None, 56, 56, 48)             192             decoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv-skip (SeparableConv2D)   (None, 56, 56, 48)             8256            concatenate_17[0][0]                           
____________________________________________________________________________________________________________________________________________
add_42 (Add)                                  (None, 56, 56, 48)             0               batch_normalization_85[0][0]                   
                                                                                             decoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_85 (Activation)                    (None, 56, 56, 48)             0               add_42[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_85 (Dropout)                          (None, 56, 56, 48)             0               activation_85[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-UP (Conv2DTranspose)          (None, 112, 112, 48)           20784           dropout_85[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_18 (Concatenate)                  (None, 112, 112, 72)           0               dropout_75[0][0]                               
                                                                                             decoder-block-1-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv1 (SeparableConv2D)       (None, 112, 112, 24)           2400            concatenate_18[0][0]                           
____________________________________________________________________________________________________________________________________________
batch_normalization_86 (BatchNormalization)   (None, 112, 112, 24)           96              decoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_86 (Activation)                    (None, 112, 112, 24)           0               batch_normalization_86[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_86 (Dropout)                          (None, 112, 112, 24)           0               activation_86[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv2 (SeparableConv2D)       (None, 112, 112, 24)           816             dropout_86[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_87 (BatchNormalization)   (None, 112, 112, 24)           96              decoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv-skip (SeparableConv2D)   (None, 112, 112, 24)           2400            concatenate_18[0][0]                           
____________________________________________________________________________________________________________________________________________
add_43 (Add)                                  (None, 112, 112, 24)           0               batch_normalization_87[0][0]                   
                                                                                             decoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_87 (Activation)                    (None, 112, 112, 24)           0               add_43[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_87 (Dropout)                          (None, 112, 112, 24)           0               activation_87[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-UP (Conv2DTranspose)          (None, 224, 224, 24)           5208            dropout_87[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_19 (Concatenate)                  (None, 224, 224, 36)           0               dropout_73[0][0]                               
                                                                                             decoder-block-0-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv1 (SeparableConv2D)       (None, 224, 224, 12)           768             concatenate_19[0][0]                           
____________________________________________________________________________________________________________________________________________
batch_normalization_88 (BatchNormalization)   (None, 224, 224, 12)           48              decoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_88 (Activation)                    (None, 224, 224, 12)           0               batch_normalization_88[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_88 (Dropout)                          (None, 224, 224, 12)           0               activation_88[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv2 (SeparableConv2D)       (None, 224, 224, 12)           264             dropout_88[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_89 (BatchNormalization)   (None, 224, 224, 12)           48              decoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv-skip (SeparableConv2D)   (None, 224, 224, 12)           768             concatenate_19[0][0]                           
____________________________________________________________________________________________________________________________________________
add_44 (Add)                                  (None, 224, 224, 12)           0               batch_normalization_89[0][0]                   
                                                                                             decoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_89 (Activation)                    (None, 224, 224, 12)           0               add_44[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_89 (Dropout)                          (None, 224, 224, 12)           0               activation_89[0][0]                            
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 224, 224, 3)            39              dropout_89[0][0]                               
============================================================================================================================================
Total params: 719,763
Trainable params: 717,927
Non-trainable params: 1,836
____________________________________________________________________________________________________________________________________________
