Model: "unet2halfd.vanilla00-f04.fold000.1606-680-413"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input (InputLayer)                            [(None, 144, 144, 5)]          0                                                              
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1 (Conv2D)                    (None, 144, 144, 4)            184             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-relu (Activation)           (None, 144, 144, 4)            0               enc-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2 (Conv2D)                    (None, 144, 144, 8)            296             enc-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-relu (Activation)           (None, 144, 144, 8)            0               enc-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN (MaxPooling2D)               (None, 72, 72, 8)              0               enc-block-0-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1 (Conv2D)                    (None, 72, 72, 8)              584             enc-block-0-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-relu (Activation)           (None, 72, 72, 8)              0               enc-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2 (Conv2D)                    (None, 72, 72, 16)             1168            enc-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-relu (Activation)           (None, 72, 72, 16)             0               enc-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN (MaxPooling2D)               (None, 36, 36, 16)             0               enc-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1 (Conv2D)                    (None, 36, 36, 16)             2320            enc-block-1-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-relu (Activation)           (None, 36, 36, 16)             0               enc-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2 (Conv2D)                    (None, 36, 36, 32)             4640            enc-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-relu (Activation)           (None, 36, 36, 32)             0               enc-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN (MaxPooling2D)               (None, 18, 18, 32)             0               enc-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1 (Conv2D)                    (None, 18, 18, 32)             9248            enc-block-2-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-relu (Activation)           (None, 18, 18, 32)             0               enc-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2 (Conv2D)                    (None, 18, 18, 64)             18496           enc-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-relu (Activation)           (None, 18, 18, 64)             0               enc-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN (MaxPooling2D)               (None, 9, 9, 64)               0               enc-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1 (Conv2D)                    (None, 9, 9, 64)               36928           enc-block-3-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-relu (Activation)           (None, 9, 9, 64)               0               enc-block-4-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2 (Conv2D)                    (None, 9, 9, 128)              73856           enc-block-4-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-relu (Activation)           (None, 9, 9, 128)              0               enc-block-4-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-UP (UpSampling2D)                 (None, 18, 18, 128)            0               enc-block-4-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 18, 18, 192)            0               enc-block-3-conv2-relu[0][0]                   
                                                                                             dec-block-3-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1 (Conv2D)                    (None, 18, 18, 64)             110656          concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-relu (Activation)           (None, 18, 18, 64)             0               dec-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2 (Conv2D)                    (None, 18, 18, 64)             36928           dec-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-relu (Activation)           (None, 18, 18, 64)             0               dec-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-UP (UpSampling2D)                 (None, 36, 36, 64)             0               dec-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 36, 36, 96)             0               enc-block-2-conv2-relu[0][0]                   
                                                                                             dec-block-2-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1 (Conv2D)                    (None, 36, 36, 32)             27680           concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-relu (Activation)           (None, 36, 36, 32)             0               dec-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2 (Conv2D)                    (None, 36, 36, 32)             9248            dec-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-relu (Activation)           (None, 36, 36, 32)             0               dec-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-UP (UpSampling2D)                 (None, 72, 72, 32)             0               dec-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 72, 72, 48)             0               enc-block-1-conv2-relu[0][0]                   
                                                                                             dec-block-1-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1 (Conv2D)                    (None, 72, 72, 16)             6928            concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-relu (Activation)           (None, 72, 72, 16)             0               dec-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2 (Conv2D)                    (None, 72, 72, 16)             2320            dec-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-relu (Activation)           (None, 72, 72, 16)             0               dec-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-UP (UpSampling2D)                 (None, 144, 144, 16)           0               dec-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 144, 144, 24)           0               enc-block-0-conv2-relu[0][0]                   
                                                                                             dec-block-0-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1 (Conv2D)                    (None, 144, 144, 8)            1736            concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-relu (Activation)           (None, 144, 144, 8)            0               dec-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2 (Conv2D)                    (None, 144, 144, 8)            584             dec-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-relu (Activation)           (None, 144, 144, 8)            0               dec-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 144, 144, 3)            27              dec-block-0-conv2-relu[0][0]                   
============================================================================================================================================
Total params: 343,827
Trainable params: 343,827
Non-trainable params: 0
____________________________________________________________________________________________________________________________________________
