Model: "unet2d.vanilla02-f08.fold000.1606-431-664"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input (InputLayer)                            [(None, 320, 320, 1)]          0                                                              
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1 (Conv2D)                    (None, 320, 320, 8)            80              input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-bn (BatchNormalization)     (None, 320, 320, 8)            32              enc-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-relu (Activation)           (None, 320, 320, 8)            0               enc-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2 (Conv2D)                    (None, 320, 320, 16)           1168            enc-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip (Conv2D)                (None, 320, 320, 16)           160             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-bn (BatchNormalization)     (None, 320, 320, 16)           64              enc-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip-bn (BatchNormalization) (None, 320, 320, 16)           64              enc-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-0-residual (Add)                    (None, 320, 320, 16)           0               enc-block-0-conv2-bn[0][0]                     
                                                                                             enc-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-relu (Activation)           (None, 320, 320, 16)           0               enc-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN (MaxPooling2D)               (None, 160, 160, 16)           0               enc-block-0-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1 (Conv2D)                    (None, 160, 160, 16)           2320            enc-block-0-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-bn (BatchNormalization)     (None, 160, 160, 16)           64              enc-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-relu (Activation)           (None, 160, 160, 16)           0               enc-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2 (Conv2D)                    (None, 160, 160, 32)           4640            enc-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip (Conv2D)                (None, 160, 160, 32)           4640            enc-block-0-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-bn (BatchNormalization)     (None, 160, 160, 32)           128             enc-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip-bn (BatchNormalization) (None, 160, 160, 32)           128             enc-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-residual (Add)                    (None, 160, 160, 32)           0               enc-block-1-conv2-bn[0][0]                     
                                                                                             enc-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-relu (Activation)           (None, 160, 160, 32)           0               enc-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN (MaxPooling2D)               (None, 80, 80, 32)             0               enc-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1 (Conv2D)                    (None, 80, 80, 32)             9248            enc-block-1-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-bn (BatchNormalization)     (None, 80, 80, 32)             128             enc-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-relu (Activation)           (None, 80, 80, 32)             0               enc-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2 (Conv2D)                    (None, 80, 80, 64)             18496           enc-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip (Conv2D)                (None, 80, 80, 64)             18496           enc-block-1-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-bn (BatchNormalization)     (None, 80, 80, 64)             256             enc-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip-bn (BatchNormalization) (None, 80, 80, 64)             256             enc-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-residual (Add)                    (None, 80, 80, 64)             0               enc-block-2-conv2-bn[0][0]                     
                                                                                             enc-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-relu (Activation)           (None, 80, 80, 64)             0               enc-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN (MaxPooling2D)               (None, 40, 40, 64)             0               enc-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1 (Conv2D)                    (None, 40, 40, 64)             36928           enc-block-2-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-bn (BatchNormalization)     (None, 40, 40, 64)             256             enc-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-relu (Activation)           (None, 40, 40, 64)             0               enc-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2 (Conv2D)                    (None, 40, 40, 128)            73856           enc-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip (Conv2D)                (None, 40, 40, 128)            73856           enc-block-2-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-bn (BatchNormalization)     (None, 40, 40, 128)            512             enc-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip-bn (BatchNormalization) (None, 40, 40, 128)            512             enc-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-residual (Add)                    (None, 40, 40, 128)            0               enc-block-3-conv2-bn[0][0]                     
                                                                                             enc-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-relu (Activation)           (None, 40, 40, 128)            0               enc-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN (MaxPooling2D)               (None, 20, 20, 128)            0               enc-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1 (Conv2D)                    (None, 20, 20, 128)            147584          enc-block-3-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-bn (BatchNormalization)     (None, 20, 20, 128)            512             enc-block-4-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-relu (Activation)           (None, 20, 20, 128)            0               enc-block-4-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2 (Conv2D)                    (None, 20, 20, 256)            295168          enc-block-4-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip (Conv2D)                (None, 20, 20, 256)            295168          enc-block-3-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-bn (BatchNormalization)     (None, 20, 20, 256)            1024            enc-block-4-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip-bn (BatchNormalization) (None, 20, 20, 256)            1024            enc-block-4-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-residual (Add)                    (None, 20, 20, 256)            0               enc-block-4-conv2-bn[0][0]                     
                                                                                             enc-block-4-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-relu (Activation)           (None, 20, 20, 256)            0               enc-block-4-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-UP (UpSampling2D)                 (None, 40, 40, 256)            0               enc-block-4-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 40, 40, 384)            0               enc-block-3-conv2-relu[0][0]                   
                                                                                             dec-block-3-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1 (Conv2D)                    (None, 40, 40, 128)            442496          concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-bn (BatchNormalization)     (None, 40, 40, 128)            512             dec-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-relu (Activation)           (None, 40, 40, 128)            0               dec-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2 (Conv2D)                    (None, 40, 40, 128)            147584          dec-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip (Conv2D)                (None, 40, 40, 128)            442496          concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-bn (BatchNormalization)     (None, 40, 40, 128)            512             dec-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip-bn (BatchNormalization) (None, 40, 40, 128)            512             dec-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-3-residual (Add)                    (None, 40, 40, 128)            0               dec-block-3-conv2-bn[0][0]                     
                                                                                             dec-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-relu (Activation)           (None, 40, 40, 128)            0               dec-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-UP (UpSampling2D)                 (None, 80, 80, 128)            0               dec-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 80, 80, 192)            0               enc-block-2-conv2-relu[0][0]                   
                                                                                             dec-block-2-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1 (Conv2D)                    (None, 80, 80, 64)             110656          concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-bn (BatchNormalization)     (None, 80, 80, 64)             256             dec-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-relu (Activation)           (None, 80, 80, 64)             0               dec-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2 (Conv2D)                    (None, 80, 80, 64)             36928           dec-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip (Conv2D)                (None, 80, 80, 64)             110656          concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-bn (BatchNormalization)     (None, 80, 80, 64)             256             dec-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip-bn (BatchNormalization) (None, 80, 80, 64)             256             dec-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-2-residual (Add)                    (None, 80, 80, 64)             0               dec-block-2-conv2-bn[0][0]                     
                                                                                             dec-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-relu (Activation)           (None, 80, 80, 64)             0               dec-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-UP (UpSampling2D)                 (None, 160, 160, 64)           0               dec-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 160, 160, 96)           0               enc-block-1-conv2-relu[0][0]                   
                                                                                             dec-block-1-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1 (Conv2D)                    (None, 160, 160, 32)           27680           concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-bn (BatchNormalization)     (None, 160, 160, 32)           128             dec-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-relu (Activation)           (None, 160, 160, 32)           0               dec-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2 (Conv2D)                    (None, 160, 160, 32)           9248            dec-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip (Conv2D)                (None, 160, 160, 32)           27680           concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-bn (BatchNormalization)     (None, 160, 160, 32)           128             dec-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip-bn (BatchNormalization) (None, 160, 160, 32)           128             dec-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-1-residual (Add)                    (None, 160, 160, 32)           0               dec-block-1-conv2-bn[0][0]                     
                                                                                             dec-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-relu (Activation)           (None, 160, 160, 32)           0               dec-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-UP (UpSampling2D)                 (None, 320, 320, 32)           0               dec-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 320, 320, 48)           0               enc-block-0-conv2-relu[0][0]                   
                                                                                             dec-block-0-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1 (Conv2D)                    (None, 320, 320, 16)           6928            concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-bn (BatchNormalization)     (None, 320, 320, 16)           64              dec-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-relu (Activation)           (None, 320, 320, 16)           0               dec-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2 (Conv2D)                    (None, 320, 320, 16)           2320            dec-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip (Conv2D)                (None, 320, 320, 16)           6928            concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-bn (BatchNormalization)     (None, 320, 320, 16)           64              dec-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip-bn (BatchNormalization) (None, 320, 320, 16)           64              dec-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-0-residual (Add)                    (None, 320, 320, 16)           0               dec-block-0-conv2-bn[0][0]                     
                                                                                             dec-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-relu (Activation)           (None, 320, 320, 16)           0               dec-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 320, 320, 3)            51              dec-block-0-conv2-relu[0][0]                   
============================================================================================================================================
Total params: 2,361,299
Trainable params: 2,357,379
Non-trainable params: 3,920
____________________________________________________________________________________________________________________________________________
