Model: "unet3d.crop112-f12.fold000.1607-466-349"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input (InputLayer)                            [(None, 112, 112, 112, 1)]     0                                                              
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1 (Conv3D)                    (None, 112, 112, 112, 12)      336             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-bn (BatchNormalization)     (None, 112, 112, 112, 12)      48              enc-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-relu (Activation)           (None, 112, 112, 112, 12)      0               enc-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2 (Conv3D)                    (None, 112, 112, 112, 24)      7800            enc-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip (Conv3D)                (None, 112, 112, 112, 24)      672             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-bn (BatchNormalization)     (None, 112, 112, 112, 24)      96              enc-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip-bn (BatchNormalization) (None, 112, 112, 112, 24)      96              enc-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-0-residual (Add)                    (None, 112, 112, 112, 24)      0               enc-block-0-conv2-bn[0][0]                     
                                                                                             enc-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-relu (Activation)           (None, 112, 112, 112, 24)      0               enc-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN (Conv3D)                     (None, 56, 56, 56, 24)         15576           enc-block-0-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-bn (BatchNormalization)      (None, 56, 56, 56, 24)         96              enc-block-0-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-relu (Activation)            (None, 56, 56, 56, 24)         0               enc-block-0-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1 (Conv3D)                    (None, 56, 56, 56, 24)         15576           enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-bn (BatchNormalization)     (None, 56, 56, 56, 24)         96              enc-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-relu (Activation)           (None, 56, 56, 56, 24)         0               enc-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2 (Conv3D)                    (None, 56, 56, 56, 48)         31152           enc-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip (Conv3D)                (None, 56, 56, 56, 48)         31152           enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-bn (BatchNormalization)     (None, 56, 56, 56, 48)         192             enc-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip-bn (BatchNormalization) (None, 56, 56, 56, 48)         192             enc-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-residual (Add)                    (None, 56, 56, 56, 48)         0               enc-block-1-conv2-bn[0][0]                     
                                                                                             enc-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-relu (Activation)           (None, 56, 56, 56, 48)         0               enc-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN (Conv3D)                     (None, 28, 28, 28, 48)         62256           enc-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-bn (BatchNormalization)      (None, 28, 28, 28, 48)         192             enc-block-1-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-relu (Activation)            (None, 28, 28, 28, 48)         0               enc-block-1-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1 (Conv3D)                    (None, 28, 28, 28, 48)         62256           enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-bn (BatchNormalization)     (None, 28, 28, 28, 48)         192             enc-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-relu (Activation)           (None, 28, 28, 28, 48)         0               enc-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2 (Conv3D)                    (None, 28, 28, 28, 96)         124512          enc-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip (Conv3D)                (None, 28, 28, 28, 96)         124512          enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-bn (BatchNormalization)     (None, 28, 28, 28, 96)         384             enc-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip-bn (BatchNormalization) (None, 28, 28, 28, 96)         384             enc-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-residual (Add)                    (None, 28, 28, 28, 96)         0               enc-block-2-conv2-bn[0][0]                     
                                                                                             enc-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-relu (Activation)           (None, 28, 28, 28, 96)         0               enc-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN (Conv3D)                     (None, 14, 14, 14, 96)         248928          enc-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-bn (BatchNormalization)      (None, 14, 14, 14, 96)         384             enc-block-2-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-relu (Activation)            (None, 14, 14, 14, 96)         0               enc-block-2-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1 (Conv3D)                    (None, 14, 14, 14, 96)         248928          enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-bn (BatchNormalization)     (None, 14, 14, 14, 96)         384             enc-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-relu (Activation)           (None, 14, 14, 14, 96)         0               enc-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2 (Conv3D)                    (None, 14, 14, 14, 192)        497856          enc-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip (Conv3D)                (None, 14, 14, 14, 192)        497856          enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-bn (BatchNormalization)     (None, 14, 14, 14, 192)        768             enc-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip-bn (BatchNormalization) (None, 14, 14, 14, 192)        768             enc-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-residual (Add)                    (None, 14, 14, 14, 192)        0               enc-block-3-conv2-bn[0][0]                     
                                                                                             enc-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-relu (Activation)           (None, 14, 14, 14, 192)        0               enc-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN (Conv3D)                     (None, 7, 7, 7, 192)           995520          enc-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-bn (BatchNormalization)      (None, 7, 7, 7, 192)           768             enc-block-3-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-relu (Activation)            (None, 7, 7, 7, 192)           0               enc-block-3-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1 (Conv3D)                    (None, 7, 7, 7, 192)           995520          enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-bn (BatchNormalization)     (None, 7, 7, 7, 192)           768             enc-block-4-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-relu (Activation)           (None, 7, 7, 7, 192)           0               enc-block-4-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2 (Conv3D)                    (None, 7, 7, 7, 384)           1991040         enc-block-4-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip (Conv3D)                (None, 7, 7, 7, 384)           1991040         enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-bn (BatchNormalization)     (None, 7, 7, 7, 384)           1536            enc-block-4-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip-bn (BatchNormalization) (None, 7, 7, 7, 384)           1536            enc-block-4-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-residual (Add)                    (None, 7, 7, 7, 384)           0               enc-block-4-conv2-bn[0][0]                     
                                                                                             enc-block-4-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-relu (Activation)           (None, 7, 7, 7, 384)           0               enc-block-4-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-UP (Conv3DTranspose)              (None, 14, 14, 14, 384)        3981696         enc-block-4-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-bn (BatchNormalization)        (None, 14, 14, 14, 384)        1536            dec-block-3-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-relu (Activation)              (None, 14, 14, 14, 384)        0               dec-block-3-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 14, 14, 14, 576)        0               enc-block-3-conv2-relu[0][0]                   
                                                                                             dec-block-3-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1 (Conv3D)                    (None, 14, 14, 14, 192)        2986176         concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-bn (BatchNormalization)     (None, 14, 14, 14, 192)        768             dec-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-relu (Activation)           (None, 14, 14, 14, 192)        0               dec-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2 (Conv3D)                    (None, 14, 14, 14, 192)        995520          dec-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip (Conv3D)                (None, 14, 14, 14, 192)        2986176         concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-bn (BatchNormalization)     (None, 14, 14, 14, 192)        768             dec-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip-bn (BatchNormalization) (None, 14, 14, 14, 192)        768             dec-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-3-residual (Add)                    (None, 14, 14, 14, 192)        0               dec-block-3-conv2-bn[0][0]                     
                                                                                             dec-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-relu (Activation)           (None, 14, 14, 14, 192)        0               dec-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-UP (Conv3DTranspose)              (None, 28, 28, 28, 192)        995520          dec-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-bn (BatchNormalization)        (None, 28, 28, 28, 192)        768             dec-block-2-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-relu (Activation)              (None, 28, 28, 28, 192)        0               dec-block-2-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 28, 28, 28, 288)        0               enc-block-2-conv2-relu[0][0]                   
                                                                                             dec-block-2-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1 (Conv3D)                    (None, 28, 28, 28, 96)         746592          concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-bn (BatchNormalization)     (None, 28, 28, 28, 96)         384             dec-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-relu (Activation)           (None, 28, 28, 28, 96)         0               dec-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2 (Conv3D)                    (None, 28, 28, 28, 96)         248928          dec-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip (Conv3D)                (None, 28, 28, 28, 96)         746592          concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-bn (BatchNormalization)     (None, 28, 28, 28, 96)         384             dec-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip-bn (BatchNormalization) (None, 28, 28, 28, 96)         384             dec-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-2-residual (Add)                    (None, 28, 28, 28, 96)         0               dec-block-2-conv2-bn[0][0]                     
                                                                                             dec-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-relu (Activation)           (None, 28, 28, 28, 96)         0               dec-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-UP (Conv3DTranspose)              (None, 56, 56, 56, 96)         248928          dec-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-bn (BatchNormalization)        (None, 56, 56, 56, 96)         384             dec-block-1-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-relu (Activation)              (None, 56, 56, 56, 96)         0               dec-block-1-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 56, 56, 56, 144)        0               enc-block-1-conv2-relu[0][0]                   
                                                                                             dec-block-1-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1 (Conv3D)                    (None, 56, 56, 56, 48)         186672          concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-bn (BatchNormalization)     (None, 56, 56, 56, 48)         192             dec-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-relu (Activation)           (None, 56, 56, 56, 48)         0               dec-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2 (Conv3D)                    (None, 56, 56, 56, 48)         62256           dec-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip (Conv3D)                (None, 56, 56, 56, 48)         186672          concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-bn (BatchNormalization)     (None, 56, 56, 56, 48)         192             dec-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip-bn (BatchNormalization) (None, 56, 56, 56, 48)         192             dec-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-1-residual (Add)                    (None, 56, 56, 56, 48)         0               dec-block-1-conv2-bn[0][0]                     
                                                                                             dec-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-relu (Activation)           (None, 56, 56, 56, 48)         0               dec-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-UP (Conv3DTranspose)              (None, 112, 112, 112, 48)      62256           dec-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-bn (BatchNormalization)        (None, 112, 112, 112, 48)      192             dec-block-0-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-relu (Activation)              (None, 112, 112, 112, 48)      0               dec-block-0-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 112, 112, 112, 72)      0               enc-block-0-conv2-relu[0][0]                   
                                                                                             dec-block-0-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1 (Conv3D)                    (None, 112, 112, 112, 24)      46680           concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-bn (BatchNormalization)     (None, 112, 112, 112, 24)      96              dec-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-relu (Activation)           (None, 112, 112, 112, 24)      0               dec-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2 (Conv3D)                    (None, 112, 112, 112, 24)      15576           dec-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip (Conv3D)                (None, 112, 112, 112, 24)      46680           concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-bn (BatchNormalization)     (None, 112, 112, 112, 24)      96              dec-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip-bn (BatchNormalization) (None, 112, 112, 112, 24)      96              dec-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-0-residual (Add)                    (None, 112, 112, 112, 24)      0               dec-block-0-conv2-bn[0][0]                     
                                                                                             dec-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-relu (Activation)           (None, 112, 112, 112, 24)      0               dec-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
out (Conv3D)                                  (None, 112, 112, 112, 3)       75              dec-block-0-conv2-relu[0][0]                   
============================================================================================================================================
Total params: 22,501,563
Trainable params: 22,493,523
Non-trainable params: 8,040
____________________________________________________________________________________________________________________________________________
