Model: "unet-2d-small.vanilla01.000.1606-233-419"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input_8 (InputLayer)                          [(None, 320, 320, 1)]          0                                                              
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv1 (SeparableConv2D)       (None, 320, 320, 16)           41              input_8[0][0]                                  
____________________________________________________________________________________________________________________________________________
batch_normalization_90 (BatchNormalization)   (None, 320, 320, 16)           64              encoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_90 (Activation)                    (None, 320, 320, 16)           0               batch_normalization_90[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_90 (Dropout)                          (None, 320, 320, 16)           0               activation_90[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv2 (SeparableConv2D)       (None, 320, 320, 32)           688             dropout_90[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_91 (BatchNormalization)   (None, 320, 320, 32)           128             encoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv-skip (SeparableConv2D)   (None, 320, 320, 32)           73              input_8[0][0]                                  
____________________________________________________________________________________________________________________________________________
add_45 (Add)                                  (None, 320, 320, 32)           0               batch_normalization_91[0][0]                   
                                                                                             encoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_91 (Activation)                    (None, 320, 320, 32)           0               add_45[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_91 (Dropout)                          (None, 320, 320, 32)           0               activation_91[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-0-DOWN (Conv2D)                 (None, 160, 160, 32)           9248            dropout_91[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv1 (SeparableConv2D)       (None, 160, 160, 32)           1344            encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_92 (BatchNormalization)   (None, 160, 160, 32)           128             encoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_92 (Activation)                    (None, 160, 160, 32)           0               batch_normalization_92[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_92 (Dropout)                          (None, 160, 160, 32)           0               activation_92[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv2 (SeparableConv2D)       (None, 160, 160, 64)           2400            dropout_92[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_93 (BatchNormalization)   (None, 160, 160, 64)           256             encoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv-skip (SeparableConv2D)   (None, 160, 160, 64)           2400            encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_46 (Add)                                  (None, 160, 160, 64)           0               batch_normalization_93[0][0]                   
                                                                                             encoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_93 (Activation)                    (None, 160, 160, 64)           0               add_46[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_93 (Dropout)                          (None, 160, 160, 64)           0               activation_93[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-1-DOWN (Conv2D)                 (None, 80, 80, 64)             36928           dropout_93[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv1 (SeparableConv2D)       (None, 80, 80, 64)             4736            encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_94 (BatchNormalization)   (None, 80, 80, 64)             256             encoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_94 (Activation)                    (None, 80, 80, 64)             0               batch_normalization_94[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_94 (Dropout)                          (None, 80, 80, 64)             0               activation_94[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv2 (SeparableConv2D)       (None, 80, 80, 128)            8896            dropout_94[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_95 (BatchNormalization)   (None, 80, 80, 128)            512             encoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv-skip (SeparableConv2D)   (None, 80, 80, 128)            8896            encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_47 (Add)                                  (None, 80, 80, 128)            0               batch_normalization_95[0][0]                   
                                                                                             encoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_95 (Activation)                    (None, 80, 80, 128)            0               add_47[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_95 (Dropout)                          (None, 80, 80, 128)            0               activation_95[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-2-DOWN (Conv2D)                 (None, 40, 40, 128)            147584          dropout_95[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv1 (SeparableConv2D)       (None, 40, 40, 128)            17664           encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_96 (BatchNormalization)   (None, 40, 40, 128)            512             encoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_96 (Activation)                    (None, 40, 40, 128)            0               batch_normalization_96[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_96 (Dropout)                          (None, 40, 40, 128)            0               activation_96[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv2 (SeparableConv2D)       (None, 40, 40, 256)            34176           dropout_96[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_97 (BatchNormalization)   (None, 40, 40, 256)            1024            encoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv-skip (SeparableConv2D)   (None, 40, 40, 256)            34176           encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_48 (Add)                                  (None, 40, 40, 256)            0               batch_normalization_97[0][0]                   
                                                                                             encoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_97 (Activation)                    (None, 40, 40, 256)            0               add_48[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_97 (Dropout)                          (None, 40, 40, 256)            0               activation_97[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-3-DOWN (Conv2D)                 (None, 20, 20, 256)            590080          dropout_97[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv1 (SeparableConv2D)       (None, 20, 20, 256)            68096           encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_98 (BatchNormalization)   (None, 20, 20, 256)            1024            encoder-block-4-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_98 (Activation)                    (None, 20, 20, 256)            0               batch_normalization_98[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_98 (Dropout)                          (None, 20, 20, 256)            0               activation_98[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv2 (SeparableConv2D)       (None, 20, 20, 512)            133888          dropout_98[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_99 (BatchNormalization)   (None, 20, 20, 512)            2048            encoder-block-4-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv-skip (SeparableConv2D)   (None, 20, 20, 512)            133888          encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_49 (Add)                                  (None, 20, 20, 512)            0               batch_normalization_99[0][0]                   
                                                                                             encoder-block-4-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_99 (Activation)                    (None, 20, 20, 512)            0               add_49[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_99 (Dropout)                          (None, 20, 20, 512)            0               activation_99[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-3-UP (Conv2DTranspose)          (None, 40, 40, 512)            2359808         dropout_99[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_20 (Concatenate)                  (None, 40, 40, 768)            0               dropout_97[0][0]                               
                                                                                             decoder-block-3-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv1 (SeparableConv2D)       (None, 40, 40, 256)            203776          concatenate_20[0][0]                           
____________________________________________________________________________________________________________________________________________
batch_normalization_100 (BatchNormalization)  (None, 40, 40, 256)            1024            decoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_100 (Activation)                   (None, 40, 40, 256)            0               batch_normalization_100[0][0]                  
____________________________________________________________________________________________________________________________________________
dropout_100 (Dropout)                         (None, 40, 40, 256)            0               activation_100[0][0]                           
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv2 (SeparableConv2D)       (None, 40, 40, 256)            68096           dropout_100[0][0]                              
____________________________________________________________________________________________________________________________________________
batch_normalization_101 (BatchNormalization)  (None, 40, 40, 256)            1024            decoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv-skip (SeparableConv2D)   (None, 40, 40, 256)            203776          concatenate_20[0][0]                           
____________________________________________________________________________________________________________________________________________
add_50 (Add)                                  (None, 40, 40, 256)            0               batch_normalization_101[0][0]                  
                                                                                             decoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_101 (Activation)                   (None, 40, 40, 256)            0               add_50[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_101 (Dropout)                         (None, 40, 40, 256)            0               activation_101[0][0]                           
____________________________________________________________________________________________________________________________________________
decoder-block-2-UP (Conv2DTranspose)          (None, 80, 80, 256)            590080          dropout_101[0][0]                              
____________________________________________________________________________________________________________________________________________
concatenate_21 (Concatenate)                  (None, 80, 80, 384)            0               dropout_95[0][0]                               
                                                                                             decoder-block-2-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv1 (SeparableConv2D)       (None, 80, 80, 128)            52736           concatenate_21[0][0]                           
____________________________________________________________________________________________________________________________________________
batch_normalization_102 (BatchNormalization)  (None, 80, 80, 128)            512             decoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_102 (Activation)                   (None, 80, 80, 128)            0               batch_normalization_102[0][0]                  
____________________________________________________________________________________________________________________________________________
dropout_102 (Dropout)                         (None, 80, 80, 128)            0               activation_102[0][0]                           
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv2 (SeparableConv2D)       (None, 80, 80, 128)            17664           dropout_102[0][0]                              
____________________________________________________________________________________________________________________________________________
batch_normalization_103 (BatchNormalization)  (None, 80, 80, 128)            512             decoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv-skip (SeparableConv2D)   (None, 80, 80, 128)            52736           concatenate_21[0][0]                           
____________________________________________________________________________________________________________________________________________
add_51 (Add)                                  (None, 80, 80, 128)            0               batch_normalization_103[0][0]                  
                                                                                             decoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_103 (Activation)                   (None, 80, 80, 128)            0               add_51[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_103 (Dropout)                         (None, 80, 80, 128)            0               activation_103[0][0]                           
____________________________________________________________________________________________________________________________________________
decoder-block-1-UP (Conv2DTranspose)          (None, 160, 160, 128)          147584          dropout_103[0][0]                              
____________________________________________________________________________________________________________________________________________
concatenate_22 (Concatenate)                  (None, 160, 160, 192)          0               dropout_93[0][0]                               
                                                                                             decoder-block-1-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv1 (SeparableConv2D)       (None, 160, 160, 64)           14080           concatenate_22[0][0]                           
____________________________________________________________________________________________________________________________________________
batch_normalization_104 (BatchNormalization)  (None, 160, 160, 64)           256             decoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_104 (Activation)                   (None, 160, 160, 64)           0               batch_normalization_104[0][0]                  
____________________________________________________________________________________________________________________________________________
dropout_104 (Dropout)                         (None, 160, 160, 64)           0               activation_104[0][0]                           
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv2 (SeparableConv2D)       (None, 160, 160, 64)           4736            dropout_104[0][0]                              
____________________________________________________________________________________________________________________________________________
batch_normalization_105 (BatchNormalization)  (None, 160, 160, 64)           256             decoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv-skip (SeparableConv2D)   (None, 160, 160, 64)           14080           concatenate_22[0][0]                           
____________________________________________________________________________________________________________________________________________
add_52 (Add)                                  (None, 160, 160, 64)           0               batch_normalization_105[0][0]                  
                                                                                             decoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_105 (Activation)                   (None, 160, 160, 64)           0               add_52[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_105 (Dropout)                         (None, 160, 160, 64)           0               activation_105[0][0]                           
____________________________________________________________________________________________________________________________________________
decoder-block-0-UP (Conv2DTranspose)          (None, 320, 320, 64)           36928           dropout_105[0][0]                              
____________________________________________________________________________________________________________________________________________
concatenate_23 (Concatenate)                  (None, 320, 320, 96)           0               dropout_91[0][0]                               
                                                                                             decoder-block-0-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv1 (SeparableConv2D)       (None, 320, 320, 32)           3968            concatenate_23[0][0]                           
____________________________________________________________________________________________________________________________________________
batch_normalization_106 (BatchNormalization)  (None, 320, 320, 32)           128             decoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_106 (Activation)                   (None, 320, 320, 32)           0               batch_normalization_106[0][0]                  
____________________________________________________________________________________________________________________________________________
dropout_106 (Dropout)                         (None, 320, 320, 32)           0               activation_106[0][0]                           
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv2 (SeparableConv2D)       (None, 320, 320, 32)           1344            dropout_106[0][0]                              
____________________________________________________________________________________________________________________________________________
batch_normalization_107 (BatchNormalization)  (None, 320, 320, 32)           128             decoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv-skip (SeparableConv2D)   (None, 320, 320, 32)           3968            concatenate_23[0][0]                           
____________________________________________________________________________________________________________________________________________
add_53 (Add)                                  (None, 320, 320, 32)           0               batch_normalization_107[0][0]                  
                                                                                             decoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_107 (Activation)                   (None, 320, 320, 32)           0               add_53[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_107 (Dropout)                         (None, 320, 320, 32)           0               activation_107[0][0]                           
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 320, 320, 3)            99              dropout_107[0][0]                              
============================================================================================================================================
Total params: 5,020,453
Trainable params: 5,015,557
Non-trainable params: 4,896
____________________________________________________________________________________________________________________________________________
