Model: "unet2d.vanilla00-f02.fold000.1606-296-268"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input (InputLayer)                            [(None, 320, 320, 1)]          0                                                              
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1 (Conv2D)                    (None, 320, 320, 2)            20              input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-relu (Activation)           (None, 320, 320, 2)            0               enc-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2 (Conv2D)                    (None, 320, 320, 4)            76              enc-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-relu (Activation)           (None, 320, 320, 4)            0               enc-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN (MaxPooling2D)               (None, 160, 160, 4)            0               enc-block-0-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1 (Conv2D)                    (None, 160, 160, 4)            148             enc-block-0-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-relu (Activation)           (None, 160, 160, 4)            0               enc-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2 (Conv2D)                    (None, 160, 160, 8)            296             enc-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-relu (Activation)           (None, 160, 160, 8)            0               enc-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN (MaxPooling2D)               (None, 80, 80, 8)              0               enc-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1 (Conv2D)                    (None, 80, 80, 8)              584             enc-block-1-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-relu (Activation)           (None, 80, 80, 8)              0               enc-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2 (Conv2D)                    (None, 80, 80, 16)             1168            enc-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-relu (Activation)           (None, 80, 80, 16)             0               enc-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN (MaxPooling2D)               (None, 40, 40, 16)             0               enc-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1 (Conv2D)                    (None, 40, 40, 16)             2320            enc-block-2-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-relu (Activation)           (None, 40, 40, 16)             0               enc-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2 (Conv2D)                    (None, 40, 40, 32)             4640            enc-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-relu (Activation)           (None, 40, 40, 32)             0               enc-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN (MaxPooling2D)               (None, 20, 20, 32)             0               enc-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1 (Conv2D)                    (None, 20, 20, 32)             9248            enc-block-3-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-relu (Activation)           (None, 20, 20, 32)             0               enc-block-4-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2 (Conv2D)                    (None, 20, 20, 64)             18496           enc-block-4-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-relu (Activation)           (None, 20, 20, 64)             0               enc-block-4-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-UP (UpSampling2D)                 (None, 40, 40, 64)             0               enc-block-4-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_8 (Concatenate)                   (None, 40, 40, 96)             0               enc-block-3-conv2-relu[0][0]                   
                                                                                             dec-block-3-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1 (Conv2D)                    (None, 40, 40, 32)             27680           concatenate_8[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-relu (Activation)           (None, 40, 40, 32)             0               dec-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2 (Conv2D)                    (None, 40, 40, 32)             9248            dec-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-relu (Activation)           (None, 40, 40, 32)             0               dec-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-UP (UpSampling2D)                 (None, 80, 80, 32)             0               dec-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_9 (Concatenate)                   (None, 80, 80, 48)             0               enc-block-2-conv2-relu[0][0]                   
                                                                                             dec-block-2-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1 (Conv2D)                    (None, 80, 80, 16)             6928            concatenate_9[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-relu (Activation)           (None, 80, 80, 16)             0               dec-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2 (Conv2D)                    (None, 80, 80, 16)             2320            dec-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-relu (Activation)           (None, 80, 80, 16)             0               dec-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-UP (UpSampling2D)                 (None, 160, 160, 16)           0               dec-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_10 (Concatenate)                  (None, 160, 160, 24)           0               enc-block-1-conv2-relu[0][0]                   
                                                                                             dec-block-1-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1 (Conv2D)                    (None, 160, 160, 8)            1736            concatenate_10[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-relu (Activation)           (None, 160, 160, 8)            0               dec-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2 (Conv2D)                    (None, 160, 160, 8)            584             dec-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-relu (Activation)           (None, 160, 160, 8)            0               dec-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-UP (UpSampling2D)                 (None, 320, 320, 8)            0               dec-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
concatenate_11 (Concatenate)                  (None, 320, 320, 12)           0               enc-block-0-conv2-relu[0][0]                   
                                                                                             dec-block-0-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1 (Conv2D)                    (None, 320, 320, 4)            436             concatenate_11[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-relu (Activation)           (None, 320, 320, 4)            0               dec-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2 (Conv2D)                    (None, 320, 320, 4)            148             dec-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-relu (Activation)           (None, 320, 320, 4)            0               dec-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 320, 320, 3)            15              dec-block-0-conv2-relu[0][0]                   
============================================================================================================================================
Total params: 86,091
Trainable params: 86,091
Non-trainable params: 0
____________________________________________________________________________________________________________________________________________
