Model: "unet3d.crop304-f16.fold000.1607-790-699"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input (InputLayer)                            [(None, 304, 304, 16, 1)]      0                                                              
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1 (Conv3D)                    (None, 304, 304, 16, 16)       448             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-bn (BatchNormalization)     (None, 304, 304, 16, 16)       64              enc-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv1-relu (Activation)           (None, 304, 304, 16, 16)       0               enc-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2 (Conv3D)                    (None, 304, 304, 16, 32)       13856           enc-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip (Conv3D)                (None, 304, 304, 16, 32)       896             input[0][0]                                    
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-bn (BatchNormalization)     (None, 304, 304, 16, 32)       128             enc-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-0-conv-skip-bn (BatchNormalization) (None, 304, 304, 16, 32)       128             enc-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-0-residual (Add)                    (None, 304, 304, 16, 32)       0               enc-block-0-conv2-bn[0][0]                     
                                                                                             enc-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-0-conv2-relu (Activation)           (None, 304, 304, 16, 32)       0               enc-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN (Conv3D)                     (None, 152, 152, 8, 32)        27680           enc-block-0-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-bn (BatchNormalization)      (None, 152, 152, 8, 32)        128             enc-block-0-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-0-DOWN-relu (Activation)            (None, 152, 152, 8, 32)        0               enc-block-0-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1 (Conv3D)                    (None, 152, 152, 8, 32)        27680           enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-bn (BatchNormalization)     (None, 152, 152, 8, 32)        128             enc-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv1-relu (Activation)           (None, 152, 152, 8, 32)        0               enc-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2 (Conv3D)                    (None, 152, 152, 8, 64)        55360           enc-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip (Conv3D)                (None, 152, 152, 8, 64)        55360           enc-block-0-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-bn (BatchNormalization)     (None, 152, 152, 8, 64)        256             enc-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-1-conv-skip-bn (BatchNormalization) (None, 152, 152, 8, 64)        256             enc-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-1-residual (Add)                    (None, 152, 152, 8, 64)        0               enc-block-1-conv2-bn[0][0]                     
                                                                                             enc-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-1-conv2-relu (Activation)           (None, 152, 152, 8, 64)        0               enc-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN (Conv3D)                     (None, 76, 76, 4, 64)          110656          enc-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-bn (BatchNormalization)      (None, 76, 76, 4, 64)          256             enc-block-1-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-1-DOWN-relu (Activation)            (None, 76, 76, 4, 64)          0               enc-block-1-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1 (Conv3D)                    (None, 76, 76, 4, 64)          110656          enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-bn (BatchNormalization)     (None, 76, 76, 4, 64)          256             enc-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv1-relu (Activation)           (None, 76, 76, 4, 64)          0               enc-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2 (Conv3D)                    (None, 76, 76, 4, 128)         221312          enc-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip (Conv3D)                (None, 76, 76, 4, 128)         221312          enc-block-1-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-bn (BatchNormalization)     (None, 76, 76, 4, 128)         512             enc-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-2-conv-skip-bn (BatchNormalization) (None, 76, 76, 4, 128)         512             enc-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-2-residual (Add)                    (None, 76, 76, 4, 128)         0               enc-block-2-conv2-bn[0][0]                     
                                                                                             enc-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-2-conv2-relu (Activation)           (None, 76, 76, 4, 128)         0               enc-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN (Conv3D)                     (None, 38, 38, 2, 128)         442496          enc-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-bn (BatchNormalization)      (None, 38, 38, 2, 128)         512             enc-block-2-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-2-DOWN-relu (Activation)            (None, 38, 38, 2, 128)         0               enc-block-2-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1 (Conv3D)                    (None, 38, 38, 2, 128)         442496          enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-bn (BatchNormalization)     (None, 38, 38, 2, 128)         512             enc-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv1-relu (Activation)           (None, 38, 38, 2, 128)         0               enc-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2 (Conv3D)                    (None, 38, 38, 2, 256)         884992          enc-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip (Conv3D)                (None, 38, 38, 2, 256)         884992          enc-block-2-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-bn (BatchNormalization)     (None, 38, 38, 2, 256)         1024            enc-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-3-conv-skip-bn (BatchNormalization) (None, 38, 38, 2, 256)         1024            enc-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-3-residual (Add)                    (None, 38, 38, 2, 256)         0               enc-block-3-conv2-bn[0][0]                     
                                                                                             enc-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-3-conv2-relu (Activation)           (None, 38, 38, 2, 256)         0               enc-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN (Conv3D)                     (None, 19, 19, 1, 256)         1769728         enc-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-bn (BatchNormalization)      (None, 19, 19, 1, 256)         1024            enc-block-3-DOWN[0][0]                         
____________________________________________________________________________________________________________________________________________
enc-block-3-DOWN-relu (Activation)            (None, 19, 19, 1, 256)         0               enc-block-3-DOWN-bn[0][0]                      
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1 (Conv3D)                    (None, 19, 19, 1, 256)         1769728         enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-bn (BatchNormalization)     (None, 19, 19, 1, 256)         1024            enc-block-4-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv1-relu (Activation)           (None, 19, 19, 1, 256)         0               enc-block-4-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2 (Conv3D)                    (None, 19, 19, 1, 512)         3539456         enc-block-4-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip (Conv3D)                (None, 19, 19, 1, 512)         3539456         enc-block-3-DOWN-relu[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-bn (BatchNormalization)     (None, 19, 19, 1, 512)         2048            enc-block-4-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
enc-block-4-conv-skip-bn (BatchNormalization) (None, 19, 19, 1, 512)         2048            enc-block-4-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
enc-block-4-residual (Add)                    (None, 19, 19, 1, 512)         0               enc-block-4-conv2-bn[0][0]                     
                                                                                             enc-block-4-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
enc-block-4-conv2-relu (Activation)           (None, 19, 19, 1, 512)         0               enc-block-4-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-UP (Conv3DTranspose)              (None, 38, 38, 2, 512)         7078400         enc-block-4-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-bn (BatchNormalization)        (None, 38, 38, 2, 512)         2048            dec-block-3-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-3-UP-relu (Activation)              (None, 38, 38, 2, 512)         0               dec-block-3-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate (Concatenate)                     (None, 38, 38, 2, 768)         0               enc-block-3-conv2-relu[0][0]                   
                                                                                             dec-block-3-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1 (Conv3D)                    (None, 38, 38, 2, 256)         5308672         concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-bn (BatchNormalization)     (None, 38, 38, 2, 256)         1024            dec-block-3-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv1-relu (Activation)           (None, 38, 38, 2, 256)         0               dec-block-3-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2 (Conv3D)                    (None, 38, 38, 2, 256)         1769728         dec-block-3-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip (Conv3D)                (None, 38, 38, 2, 256)         5308672         concatenate[0][0]                              
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-bn (BatchNormalization)     (None, 38, 38, 2, 256)         1024            dec-block-3-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-3-conv-skip-bn (BatchNormalization) (None, 38, 38, 2, 256)         1024            dec-block-3-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-3-residual (Add)                    (None, 38, 38, 2, 256)         0               dec-block-3-conv2-bn[0][0]                     
                                                                                             dec-block-3-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-3-conv2-relu (Activation)           (None, 38, 38, 2, 256)         0               dec-block-3-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-UP (Conv3DTranspose)              (None, 76, 76, 4, 256)         1769728         dec-block-3-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-bn (BatchNormalization)        (None, 76, 76, 4, 256)         1024            dec-block-2-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-2-UP-relu (Activation)              (None, 76, 76, 4, 256)         0               dec-block-2-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                   (None, 76, 76, 4, 384)         0               enc-block-2-conv2-relu[0][0]                   
                                                                                             dec-block-2-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1 (Conv3D)                    (None, 76, 76, 4, 128)         1327232         concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-bn (BatchNormalization)     (None, 76, 76, 4, 128)         512             dec-block-2-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv1-relu (Activation)           (None, 76, 76, 4, 128)         0               dec-block-2-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2 (Conv3D)                    (None, 76, 76, 4, 128)         442496          dec-block-2-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip (Conv3D)                (None, 76, 76, 4, 128)         1327232         concatenate_1[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-bn (BatchNormalization)     (None, 76, 76, 4, 128)         512             dec-block-2-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-2-conv-skip-bn (BatchNormalization) (None, 76, 76, 4, 128)         512             dec-block-2-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-2-residual (Add)                    (None, 76, 76, 4, 128)         0               dec-block-2-conv2-bn[0][0]                     
                                                                                             dec-block-2-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-2-conv2-relu (Activation)           (None, 76, 76, 4, 128)         0               dec-block-2-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-UP (Conv3DTranspose)              (None, 152, 152, 8, 128)       442496          dec-block-2-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-bn (BatchNormalization)        (None, 152, 152, 8, 128)       512             dec-block-1-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-1-UP-relu (Activation)              (None, 152, 152, 8, 128)       0               dec-block-1-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                   (None, 152, 152, 8, 192)       0               enc-block-1-conv2-relu[0][0]                   
                                                                                             dec-block-1-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1 (Conv3D)                    (None, 152, 152, 8, 64)        331840          concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-bn (BatchNormalization)     (None, 152, 152, 8, 64)        256             dec-block-1-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv1-relu (Activation)           (None, 152, 152, 8, 64)        0               dec-block-1-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2 (Conv3D)                    (None, 152, 152, 8, 64)        110656          dec-block-1-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip (Conv3D)                (None, 152, 152, 8, 64)        331840          concatenate_2[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-bn (BatchNormalization)     (None, 152, 152, 8, 64)        256             dec-block-1-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-1-conv-skip-bn (BatchNormalization) (None, 152, 152, 8, 64)        256             dec-block-1-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-1-residual (Add)                    (None, 152, 152, 8, 64)        0               dec-block-1-conv2-bn[0][0]                     
                                                                                             dec-block-1-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-1-conv2-relu (Activation)           (None, 152, 152, 8, 64)        0               dec-block-1-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-UP (Conv3DTranspose)              (None, 304, 304, 16, 64)       110656          dec-block-1-conv2-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-bn (BatchNormalization)        (None, 304, 304, 16, 64)       256             dec-block-0-UP[0][0]                           
____________________________________________________________________________________________________________________________________________
dec-block-0-UP-relu (Activation)              (None, 304, 304, 16, 64)       0               dec-block-0-UP-bn[0][0]                        
____________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                   (None, 304, 304, 16, 96)       0               enc-block-0-conv2-relu[0][0]                   
                                                                                             dec-block-0-UP-relu[0][0]                      
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1 (Conv3D)                    (None, 304, 304, 16, 32)       82976           concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-bn (BatchNormalization)     (None, 304, 304, 16, 32)       128             dec-block-0-conv1[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv1-relu (Activation)           (None, 304, 304, 16, 32)       0               dec-block-0-conv1-bn[0][0]                     
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2 (Conv3D)                    (None, 304, 304, 16, 32)       27680           dec-block-0-conv1-relu[0][0]                   
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip (Conv3D)                (None, 304, 304, 16, 32)       82976           concatenate_3[0][0]                            
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-bn (BatchNormalization)     (None, 304, 304, 16, 32)       128             dec-block-0-conv2[0][0]                        
____________________________________________________________________________________________________________________________________________
dec-block-0-conv-skip-bn (BatchNormalization) (None, 304, 304, 16, 32)       128             dec-block-0-conv-skip[0][0]                    
____________________________________________________________________________________________________________________________________________
dec-block-0-residual (Add)                    (None, 304, 304, 16, 32)       0               dec-block-0-conv2-bn[0][0]                     
                                                                                             dec-block-0-conv-skip-bn[0][0]                 
____________________________________________________________________________________________________________________________________________
dec-block-0-conv2-relu (Activation)           (None, 304, 304, 16, 32)       0               dec-block-0-residual[0][0]                     
____________________________________________________________________________________________________________________________________________
out (Conv3D)                                  (None, 304, 304, 16, 3)        99              dec-block-0-conv2-relu[0][0]                   
============================================================================================================================================
Total params: 39,993,379
Trainable params: 39,982,659
Non-trainable params: 10,720
____________________________________________________________________________________________________________________________________________
