Model: "dryrun-03"
____________________________________________________________________________________________________________________________________________
Layer (type)                                  Output Shape                   Param #         Connected to                                   
============================================================================================================================================
input_2 (InputLayer)                          [(None, 224, 224, 1)]          0                                                              
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv1 (SeparableConv2D)       (None, 224, 224, 12)           33              input_2[0][0]                                  
____________________________________________________________________________________________________________________________________________
batch_normalization_18 (BatchNormalization)   (None, 224, 224, 12)           48              encoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_18 (Activation)                    (None, 224, 224, 12)           0               batch_normalization_18[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_18 (Dropout)                          (None, 224, 224, 12)           0               activation_18[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv2 (SeparableConv2D)       (None, 224, 224, 24)           420             dropout_18[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_19 (BatchNormalization)   (None, 224, 224, 24)           96              encoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-0-conv-skip (SeparableConv2D)   (None, 224, 224, 24)           57              input_2[0][0]                                  
____________________________________________________________________________________________________________________________________________
add_9 (Add)                                   (None, 224, 224, 24)           0               batch_normalization_19[0][0]                   
                                                                                             encoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_19 (Activation)                    (None, 224, 224, 24)           0               add_9[0][0]                                    
____________________________________________________________________________________________________________________________________________
dropout_19 (Dropout)                          (None, 224, 224, 24)           0               activation_19[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-0-DOWN (Conv2D)                 (None, 112, 112, 24)           5208            dropout_19[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv1 (SeparableConv2D)       (None, 112, 112, 24)           816             encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_20 (BatchNormalization)   (None, 112, 112, 24)           96              encoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_20 (Activation)                    (None, 112, 112, 24)           0               batch_normalization_20[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_20 (Dropout)                          (None, 112, 112, 24)           0               activation_20[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv2 (SeparableConv2D)       (None, 112, 112, 48)           1416            dropout_20[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_21 (BatchNormalization)   (None, 112, 112, 48)           192             encoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-1-conv-skip (SeparableConv2D)   (None, 112, 112, 48)           1416            encoder-block-0-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_10 (Add)                                  (None, 112, 112, 48)           0               batch_normalization_21[0][0]                   
                                                                                             encoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_21 (Activation)                    (None, 112, 112, 48)           0               add_10[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_21 (Dropout)                          (None, 112, 112, 48)           0               activation_21[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-1-DOWN (Conv2D)                 (None, 56, 56, 48)             20784           dropout_21[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv1 (SeparableConv2D)       (None, 56, 56, 48)             2784            encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_22 (BatchNormalization)   (None, 56, 56, 48)             192             encoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_22 (Activation)                    (None, 56, 56, 48)             0               batch_normalization_22[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_22 (Dropout)                          (None, 56, 56, 48)             0               activation_22[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv2 (SeparableConv2D)       (None, 56, 56, 96)             5136            dropout_22[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_23 (BatchNormalization)   (None, 56, 56, 96)             384             encoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-2-conv-skip (SeparableConv2D)   (None, 56, 56, 96)             5136            encoder-block-1-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_11 (Add)                                  (None, 56, 56, 96)             0               batch_normalization_23[0][0]                   
                                                                                             encoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_23 (Activation)                    (None, 56, 56, 96)             0               add_11[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_23 (Dropout)                          (None, 56, 56, 96)             0               activation_23[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-2-DOWN (Conv2D)                 (None, 28, 28, 96)             83040           dropout_23[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv1 (SeparableConv2D)       (None, 28, 28, 96)             10176           encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_24 (BatchNormalization)   (None, 28, 28, 96)             384             encoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_24 (Activation)                    (None, 28, 28, 96)             0               batch_normalization_24[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_24 (Dropout)                          (None, 28, 28, 96)             0               activation_24[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv2 (SeparableConv2D)       (None, 28, 28, 192)            19488           dropout_24[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_25 (BatchNormalization)   (None, 28, 28, 192)            768             encoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-3-conv-skip (SeparableConv2D)   (None, 28, 28, 192)            19488           encoder-block-2-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_12 (Add)                                  (None, 28, 28, 192)            0               batch_normalization_25[0][0]                   
                                                                                             encoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_25 (Activation)                    (None, 28, 28, 192)            0               add_12[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_25 (Dropout)                          (None, 28, 28, 192)            0               activation_25[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-3-DOWN (Conv2D)                 (None, 14, 14, 192)            331968          dropout_25[0][0]                               
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv1 (SeparableConv2D)       (None, 14, 14, 192)            38784           encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
batch_normalization_26 (BatchNormalization)   (None, 14, 14, 192)            768             encoder-block-4-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_26 (Activation)                    (None, 14, 14, 192)            0               batch_normalization_26[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_26 (Dropout)                          (None, 14, 14, 192)            0               activation_26[0][0]                            
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv2 (SeparableConv2D)       (None, 14, 14, 384)            75840           dropout_26[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_27 (BatchNormalization)   (None, 14, 14, 384)            1536            encoder-block-4-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
encoder-block-4-conv-skip (SeparableConv2D)   (None, 14, 14, 384)            75840           encoder-block-3-DOWN[0][0]                     
____________________________________________________________________________________________________________________________________________
add_13 (Add)                                  (None, 14, 14, 384)            0               batch_normalization_27[0][0]                   
                                                                                             encoder-block-4-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_27 (Activation)                    (None, 14, 14, 384)            0               add_13[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_27 (Dropout)                          (None, 14, 14, 384)            0               activation_27[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-3-UP (Conv2DTranspose)          (None, 28, 28, 384)            1327488         dropout_27[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_4 (Concatenate)                   (None, 28, 28, 576)            0               dropout_25[0][0]                               
                                                                                             decoder-block-3-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv1 (SeparableConv2D)       (None, 28, 28, 192)            115968          concatenate_4[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_28 (BatchNormalization)   (None, 28, 28, 192)            768             decoder-block-3-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_28 (Activation)                    (None, 28, 28, 192)            0               batch_normalization_28[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_28 (Dropout)                          (None, 28, 28, 192)            0               activation_28[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv2 (SeparableConv2D)       (None, 28, 28, 192)            38784           dropout_28[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_29 (BatchNormalization)   (None, 28, 28, 192)            768             decoder-block-3-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-3-conv-skip (SeparableConv2D)   (None, 28, 28, 192)            115968          concatenate_4[0][0]                            
____________________________________________________________________________________________________________________________________________
add_14 (Add)                                  (None, 28, 28, 192)            0               batch_normalization_29[0][0]                   
                                                                                             decoder-block-3-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_29 (Activation)                    (None, 28, 28, 192)            0               add_14[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_29 (Dropout)                          (None, 28, 28, 192)            0               activation_29[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-UP (Conv2DTranspose)          (None, 56, 56, 192)            331968          dropout_29[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_5 (Concatenate)                   (None, 56, 56, 288)            0               dropout_23[0][0]                               
                                                                                             decoder-block-2-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv1 (SeparableConv2D)       (None, 56, 56, 96)             30336           concatenate_5[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_30 (BatchNormalization)   (None, 56, 56, 96)             384             decoder-block-2-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_30 (Activation)                    (None, 56, 56, 96)             0               batch_normalization_30[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_30 (Dropout)                          (None, 56, 56, 96)             0               activation_30[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv2 (SeparableConv2D)       (None, 56, 56, 96)             10176           dropout_30[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_31 (BatchNormalization)   (None, 56, 56, 96)             384             decoder-block-2-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-2-conv-skip (SeparableConv2D)   (None, 56, 56, 96)             30336           concatenate_5[0][0]                            
____________________________________________________________________________________________________________________________________________
add_15 (Add)                                  (None, 56, 56, 96)             0               batch_normalization_31[0][0]                   
                                                                                             decoder-block-2-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_31 (Activation)                    (None, 56, 56, 96)             0               add_15[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_31 (Dropout)                          (None, 56, 56, 96)             0               activation_31[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-UP (Conv2DTranspose)          (None, 112, 112, 96)           83040           dropout_31[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_6 (Concatenate)                   (None, 112, 112, 144)          0               dropout_21[0][0]                               
                                                                                             decoder-block-1-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv1 (SeparableConv2D)       (None, 112, 112, 48)           8256            concatenate_6[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_32 (BatchNormalization)   (None, 112, 112, 48)           192             decoder-block-1-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_32 (Activation)                    (None, 112, 112, 48)           0               batch_normalization_32[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_32 (Dropout)                          (None, 112, 112, 48)           0               activation_32[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv2 (SeparableConv2D)       (None, 112, 112, 48)           2784            dropout_32[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_33 (BatchNormalization)   (None, 112, 112, 48)           192             decoder-block-1-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-1-conv-skip (SeparableConv2D)   (None, 112, 112, 48)           8256            concatenate_6[0][0]                            
____________________________________________________________________________________________________________________________________________
add_16 (Add)                                  (None, 112, 112, 48)           0               batch_normalization_33[0][0]                   
                                                                                             decoder-block-1-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_33 (Activation)                    (None, 112, 112, 48)           0               add_16[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_33 (Dropout)                          (None, 112, 112, 48)           0               activation_33[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-UP (Conv2DTranspose)          (None, 224, 224, 48)           20784           dropout_33[0][0]                               
____________________________________________________________________________________________________________________________________________
concatenate_7 (Concatenate)                   (None, 224, 224, 72)           0               dropout_19[0][0]                               
                                                                                             decoder-block-0-UP[0][0]                       
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv1 (SeparableConv2D)       (None, 224, 224, 24)           2400            concatenate_7[0][0]                            
____________________________________________________________________________________________________________________________________________
batch_normalization_34 (BatchNormalization)   (None, 224, 224, 24)           96              decoder-block-0-conv1[0][0]                    
____________________________________________________________________________________________________________________________________________
activation_34 (Activation)                    (None, 224, 224, 24)           0               batch_normalization_34[0][0]                   
____________________________________________________________________________________________________________________________________________
dropout_34 (Dropout)                          (None, 224, 224, 24)           0               activation_34[0][0]                            
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv2 (SeparableConv2D)       (None, 224, 224, 24)           816             dropout_34[0][0]                               
____________________________________________________________________________________________________________________________________________
batch_normalization_35 (BatchNormalization)   (None, 224, 224, 24)           96              decoder-block-0-conv2[0][0]                    
____________________________________________________________________________________________________________________________________________
decoder-block-0-conv-skip (SeparableConv2D)   (None, 224, 224, 24)           2400            concatenate_7[0][0]                            
____________________________________________________________________________________________________________________________________________
add_17 (Add)                                  (None, 224, 224, 24)           0               batch_normalization_35[0][0]                   
                                                                                             decoder-block-0-conv-skip[0][0]                
____________________________________________________________________________________________________________________________________________
activation_35 (Activation)                    (None, 224, 224, 24)           0               add_17[0][0]                                   
____________________________________________________________________________________________________________________________________________
dropout_35 (Dropout)                          (None, 224, 224, 24)           0               activation_35[0][0]                            
____________________________________________________________________________________________________________________________________________
out (Conv2D)                                  (None, 224, 224, 3)            75              dropout_35[0][0]                               
============================================================================================================================================
Total params: 2,835,009
Trainable params: 2,831,337
Non-trainable params: 3,672
____________________________________________________________________________________________________________________________________________
